README.org
# -*- coding: utf-8
#+OPTIONS: ^:{}
#+TITLE: SUK 嘅 EMACS 配置
#+STARTUP: showeverything
#+PROPERTY: header-args:emacs-lisp+   :tangle yes :results silent :exports code :eval never-export
#+FILETAGS: :emacs:
#+LANGUAGE: zh-CN
#+DATE: {{{time(%Y 年%0m 月%d 日)}}}
#+AUTHOR: Suk
#+EMAIL:  bruceasu@gmail.com

* 前言
:PROPERTIES:
:CUSTOM_ID: babel-init
:END:
<<babel-init>>


呢个係我个人嘅配置。其实好长，但部分原因系我有时会将博客文章留返喺度做
注释，仲有因为我有好多细节嘅自定义，可能我自己都唔记得晒。 如果你啱啱
接触 Emacs Lisp，你可能唔想直接复制粘贴咁多代码块。相反，你可以复制啲
小部分（记住每次复制时要确保括号成对）放入你嘅 ~*scratch*~ buffer 或者其
他 ~emacs-lisp-mode~ 嘅 buffer 入面。用 ~M-x eval-buffer~ 来执行啲代码，睇
下 Emacs 嘅表现你钟唔钟意。

我安装咗好多软件包。当你见到 ~use-package~ 同某个包名，你可以用 ~M-x
package-install~ 来安装嗰个包。

如果你喺睇 Org 文件。你可以将源代码块（即系 ~begin_src~ 入面嘅内容）打开
喺独立嘅 buffer。只需要将光标移入代码块，然后按 ~C-c '~
(~org-edit-special~)。咁样会开一个新嘅 buffer 用 =emacs-lisp-mode= ，你可
以用 =M-x eval-buffer= 来加载修改。想深入了解函数点样运作，可以用 =M-x
edebug-defun= 来调试个函数，然后调用佢。你可以喺 [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html][Emacs Lisp]] 手册了解更多。
<<starting-up>>

#+begin_src emacs-lisp :tangle early-init.el :eval never-export
  ;;; early-init.el --- Early Init File -*- lexical-binding: t; no-byte-compile: t -*-
  ;; NOTE: early-init.el is now generated from readme.org.  Please edit that file instead

  ;; 将垃圾收集推迟到启动过程中的更后面。
  (setq gc-cons-threshold most-positive-fixnum gc-cons-percentage 0.8)
  (setq inhibit-startup-message t)

  ;; 喺 Emacs 27 及之后版本，软件包初始化会喺 `user-init-file` 加载之
  ;; 前进行，但系会喺 `early-init-file` 之后进行。我哋必须阻止 Emacs
  ;; 提前做呢个操作！
  (setq package-enable-at-startup nil)
  ;;唔好允许从软件包缓存加载（原因一样）。
  (setq package-quickstart nil)
  ;; `use-package` 喺 29 版本开始内置。它必须喺加载 `use-package` 之
  ;; 前设置。
  (setq use-package-enable-imenu-support t)
  ;; 系统默认编码
  (set-language-environment 'utf-8)
  ;; 更干净嘅 GUI
  ;; 通过尽早禁用呢啲 UI 元素，避免出现未加样式嘅 Emacs 瞬间显示。
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; 调整 Emacs 窗口大小可能系更改字体时非常昂贵嘅操作。
  ;; 通过禁用呢个操作，当字体大过系统默认字体时，我哋可以轻松将启动时间减少一半。
  (setq frame-inhibit-implied-resize t)
  (setq default-frame-alist
        (append '((width                . 140)  ; Frame幅
                  (height               . 40 )  ; Frame高
                  (left                 . 170 ) ; 配置左位置
                  (top                  . 30 )  ; 配置上位置
                  (line-spacing         . 0  )  ; 文字間隔
                  (left-fringe          . 12 )  ; 左fringe幅
                  (right-fringe         . 12 )  ; 右fringe幅
                  (menu-bar-lines       . 1  )  ; 菜单行
                  (cursor-type          . bar)  ; 光标種別
                  (alpha                . 100)  ; 透明度
                  )
                default-frame-alist))
  (setq initial-frame-alist default-frame-alist)

  ;; 元素一部分禁用
  (when (fboundp 'menu-bar-mode) (menu-bar-mode -1)) ; keep the menu is better.
  (when (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (when (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
  (toggle-frame-maximized)
  ;; 緩衝區，无令立殺之。
  (setq kill-buffer-query-functions (delq 'process-kill-buffer-query-function kill-buffer-query-functions))
  (setq find-file-visit-truename t)
  (provide 'early-init)
  ;;(global-unset-key (kbd "C-SPC"))

  ;;; early-init.el ends here
#+end_src


** 调试贴士
如果啲嘢壞咗，我可以用：

- ~check-parens~ 嚟搵唔啱嘅括號
- package: *bug-hunter* 將我嘅配置分成兩半
- ~trace-function-background~ 將資訊列印到緩衝區
- ~profiler-start~ 嚟搵多啲有關慢函數嘅資訊

** 呢个係我嘅 init.el :
:PROPERTIES:
:CUSTOM_ID: init
:END:
<<init>>


#+BEGIN_SRC emacs-lisp :tangle init.el :eval never-export
  (provide 'init);; 定义一啲目录，方便日后迁移。user-emacs-directory 通常係 ~/.emacs.d
  ;; windows 下, ~/ 通常係 $EMACS_INSTALL_DIR, 或者 EMACS 测定嘅 `HOME`
  ;; 变量。
  (defvar suk-emacs-root-dir      (file-truename user-emacs-directory))
  (defvar suk-emacs-config-dir    (expand-file-name "etc" suk-emacs-root-dir))
  (defvar suk-emacs-extension-dir (expand-file-name "extensions" suk-emacs-root-dir))
  (defvar suk-emacs-share-dir     (expand-file-name "share" suk-emacs-root-dir))
  (defvar suk-emacs-themes-dir    (expand-file-name "themes" suk-emacs-share-dir))
  (defvar suk-emacs-var-dir       (expand-file-name "var" suk-emacs-root-dir))
  (defvar suk-emacs-tmp-dir       (expand-file-name "tmp" suk-emacs-var-dir))
  (defvar suk-emacs-backup-dir    (expand-file-name "backup" suk-emacs-tmp-dir))
  
  ;; OS 嘅 HOME 目录。
  (defvar user-home-dir (getenv "HOME"))
  (if (eq system-type 'windows-nt) (defvar user-home-dir (getenv "USERPROFILE")))
  ;; blink search
  (setq blink-search-db-path (expand-file-name "blink-search.db" suk-emacs-tmp-dir))
  ;; 历史
  (setq savehist-file (concat suk-emacs-var-dir "/history"))
  ;; Amx
  (setq amx-save-file (concat suk-emacs-var-dir "/amx-items"))
  ;; 自动保存
  (setq auto-save-list-file-prefix (concat suk-emacs-var-dir "/auto-save-list/.saves-"))
  ;; Eshell
  (setq eshell-directory-name (concat suk-emacs-var-dir "/eschell"))
  (setq eshell-history-file-name (concat eshell-directory-name "/history"))
  ;; projectitle-bookmarks
  (setq projectile-known-projects-file (concat suk-emacs-var-dir "/projectile-bookmarks.eld"))
  (setq backup-directory-alist `(("" . ,suk-emacs-tmp-dir)))
  ;; Bookmark
  (setq bookmark-default-file (concat suk-emacs-var-dir "/emacs.bmk"))
  ;; Diary
  (setq diary-file (concat user-home-dir "/diary"))
  ;; server 无效
  (require 'server)
  ;;(setq server-socket-dir suk-emacs-var-dir)

  ;; Clear to avoid analyzing files when loading remote files.
  (setq file-name-handler-alist nil)
  ;; Don't pass case-insensitive to `auto-mode-alist'
  (setq auto-mode-case-fold nil)


   (unless (file-exists-p suk-emacs-var-dir)
    (make-directory cache-dir t))
   (setq projectile-cache-file (expand-file-name "projectile.cache" suk-emacs-var-dir))

#+END_SRC

*** 加载目录函数：递归  Emacs 同埋插件嘅设定目录到 `load-path`
:PROPERTIES:
:CUSTOM_ID: load-path-settings
:END:
<<load-path-settings>>

#+BEGIN_SRC emacs-lisp :tangle init.el  :eval never-export
  ;; Ignore `cl` expiration warnings
  (setq byte-compile-warnings '(cl-function))

  ;; original version
  ;;(defun add-subdirs-to-load-path (dir)
  ;;  "Recursive add directories to `load-path'."
  ;;  (let ((default-directory (file-name-as-directory dir)))
  ;;     (add-to-list 'load-path dir)
  ;;     (normal-top-level-add-subdirs-to-load-path)))

  ;; 王勇的版本 https://manateelazycat.github.io/emacs/2022/03/02/emacs-load-directory-recursively.html
  (require 'cl-lib)
  (defun add-subdirs-to-load-path (search-dir isFirst)
    (interactive)
    (when isFirst
      ;; The original version did not add the first search-dir itself to
      ;; the `load path`. The recursive search-dir was added before the
      ;; recursion.
      (add-to-list 'load-path search-dir))
    (let* ((dir (file-name-as-directory search-dir)))
      (dolist (subdir
               ;; goleui bat bityiu ge mukluk, taising Emacs kaidung cudou.
               (cl-remove-if
                #'(lambda (subdir)
                    (or
                     ;; m hai mangin
                     (not (file-directory-p (concat dir subdir)))
                     ;; yiceui haamin ge mukluk
                     (member subdir '("." ".." ; Linux/Uniux haitung ge  dongcin mukluk tungmaai fu mukluk
                                      "dist" "node_modules" "__pycache__" ; takding ge yüyin seunggwaan ge mukluk
                                      "RCS" "CVS" "rcs" "cvs" ".git" ".github")))) ; baanbun hungjai mukluk
                (directory-files dir)))
        (let ((subdir-path (concat dir (file-name-as-directory subdir))))
          ;; mukluk bauhaam  .el .so .dll ge mangin di louging sinji gaa dou `load-path` binleung
          (when (cl-some #'(lambda (subdir-file)
                             (and (file-regular-p (concat subdir-path subdir-file))
                                  ;; .so .dll 文件指非Elisp语言编写的Emacs动态库
                                  (member (file-name-extension subdir-file) '("el" "so" "dll"))))
                         (directory-files subdir-path))

            ;; jüyi: add-to-list ge daisaam go caamsou bitseuiwai t, timgaa dou meibou,
            ;; kokbou gwongdou yausin
            (add-to-list 'load-path subdir-path t))

          ;; geieuuk daigwai sausok ji mukluk.
          (add-subdirs-to-load-path subdir-path nil)))))

  ;; 加载定义的目录
  (add-subdirs-to-load-path suk-emacs-config-dir t)
  (add-subdirs-to-load-path suk-emacs-extension-dir t)
  (add-subdirs-to-load-path suk-emacs-themes-dir t)

  ;; (add-to-list 'load-path "/usr/local/share/emacs/site-lisp")
  ;; (add-to-list 'load-path "~/vendor/org-mode/lisp")
  ;; (add-to-list 'load-path "~/vendor/org-mode/contrib/lisp")
  ;; (setq custom-file "~/.config/emacs/custom-settings.el")
  ;; (load custom-file t)
#+END_SRC

*** 设置 GC
:PROPERTIES:
:CUSTOM_ID: gc-settings
:END:
<<gc-settings>>

#+begin_src emacs-lisp :tangle init.el :eavl never-export

  (setq gc-cons-threshold most-positive-fixnum)
  (setq gc-cons-percentage 0.8)
  ;; Reset the GC setting
  (add-hook 'emacs-startup-hook
            (lambda ()
              ;; 默认係 0.8MB
              ;;(setq gc-cons-threshold 80000000)
              (message "Emacs ready in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)
              (defun my-cleanup-gc ()
                "Clean up gc."
                (setq gc-cons-threshold  67108864) ; 64M
                (setq gc-cons-percentage 0.1) ; original value
                (garbage-collect))
              (run-with-idle-timer 4 nil #'my-cleanup-gc)
              (add-hook 'focus-out-hook 'garbage-collect)))


#+end_src

*** 常量定义
:PROPERTIES:
:CUSTOM_ID: const
:END:
<<const>>

#+begin_src emacs-lisp :tangle init.el :eval never-export
  (defconst sys/win32p
    (eq system-type 'windows-nt)
    "Are we running on a WinTel system?")

  (defconst sys/linuxp
    (eq system-type 'gnu/linux)
    "Are we running on a GNU/Linux system?")

  (defconst sys/macp
    (eq system-type 'darwin)
    "Are we running on a Mac system?")

  (defconst sys/mac-x-p
    (and (display-graphic-p) sys/macp)
    "Are we running under X on a Mac system?")

  (defconst sys/linux-x-p
    (and (display-graphic-p) sys/linuxp)
    "Are we running under X on a GNU/Linux system?")

  (defconst sys/cygwinp
    (eq system-type 'cygwin)
    "Are we running on a Cygwin system?")

  (defconst sys/rootp
    (string-equal "root" (getenv "USER"))
    "Are you using ROOT user?")

  (defconst emacs/>=25p
    (>= emacs-major-version 25)
    "Emacs is 25 or above.")

  (defconst emacs/>=26p
    (>= emacs-major-version 26)
    "Emacs is 26 or above.")

  (defconst emacs/>=27p
    (>= emacs-major-version 27)
    "Emacs is 27 or above.")

  (defconst emacs/>=28p
    (>= emacs-major-version 28)
    "Emacs is 28 or above.")

  (defconst emacs/>=29p
    (>= emacs-major-version 29)
    "Emacs is 29 or above.")

  (defconst emacs/>=30p
    (>= emacs-major-version 30)
    "Emacs is 30 or above.")
#+end_src

