README.org
*** 載入自訂設定
:PROPERTIES:
:CUSTOM_ID: setup-custom
:END:
<<setup-custom>>

#+begin_src emacs-lisp :tangle init.el :eval never-export
  ;; set const
  (defconst custom-template-file
    (expand-file-name "custom-template.el" user-emacs-directory)
    "Custom template file of Suk's Emacs.")

  (defconst suk-homepage
    "https://github.com/bruceasu/.emacs.d"
    "The Github page of this Emacs config.")


  (defgroup suk nil
    "suk Emacs customizations."
    :group 'convenience
    :link '(url-link :tag "Homepage" "https://github.com/bruceasu/.emacs.d"))

  (defcustom suk-icon t
    "Display icons or not."
    :group 'suk
    :type 'boolean)

  (defcustom org-roam-directory (expand-file-name "RoamNotes" user-home-dir)
    "The org roam directory."
    :group 'suk
    :type 'string)

  (defcustom org-files-directory (expand-file-name "org" user-home-dir)
    "The org roam directory."
    :group 'suk
    :type 'string)

  (defcustom my-org-inline-css-file "~/.emacs.d/share/my-org-style-min.css"
    "The org css style file."
    :group 'suk
    :type 'string)

  (defcustom suk-prettify-symbols-alist
    '(("lambda" . ?λ)
      ("<-"     . ?←)
      ("->"     . ?→)
      ("->>"    . ?↠)
      ("=>"     . ?⇒)
      ("map"    . ?↦)
      ("/="     . ?≠)
      ("!="     . ?≠)
      ("=="     . ?≡)
      ("<="     . ?≤)
      (">="     . ?≥)
      ("=<<"    . (?= (Br . Bl) ?≪))
      (">>="    . (?≫ (Br . Bl) ?=))
      ("<=<"    . ?↢)
      (">=>"    . ?↣)
      ("&&"     . ?∧)
      ("||"     . ?∨)
      ("not"    . ?¬))
    "A list of symbol prettifications. Nil to use font supports ligatures."
    :group 'suk
    :type '(alist :key-type string :value-type (choice character sexp)))

  (defcustom suk-prettify-org-symbols-alist
    '(("[ ]"            . ?)
      ("[-]"            . ?)
      ("[X]"            . ?)

      (":PROPERTIES:"   . ?)
      ("#+END_SRC"      . ?□)
      ("#+BEGIN_QUOTE"  . ?«)
      ("#+END_QUOTE"    . ?»)
      )
    "A list of symbol prettifications for `org-mode'."
    :group 'suk
    :type '(alist :key-type string :value-type (choice character sexp)))


   (defcustom suk-rime t
    "Display use emacs rime or not."
    :group 'suk
    :type 'boolean)
  
   (defcustom suk-copilot-enable nil
     "Enable copilot mode"
     :group 'suk
     :type 'boolean)

  (defcustom  suk-eglot-enable nil
    "Enable eglot mode"
    :group 'suk
    :type 'boolean)

  ;; Load `custom-file'
  ;; If it doesn't exist, copy from the template, then load it.
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))

  (let ((custom-template-file
         (expand-file-name "custom-template.el" user-emacs-directory)))
    (if (and (file-exists-p custom-template-file)
             (not (file-exists-p custom-file)))
        (copy-file custom-template-file custom-file)))

  (load-file custom-file)
  ;;(if (file-exists-p custom-file)
  ;;    (load custom-file))

  ;; Load `custom-post.el'
  ;; Put personal configurations to override defaults here.
  (add-hook 'after-init-hook
            (lambda ()
              (let ((file
                     (expand-file-name "custom-post.el" user-emacs-directory)))
                (if (file-exists-p file)
                    (load file)))))
#+end_src

*** 通用函数
:PROPERTIES:
:CUSTOM_ID: setup-common-functions
:END:
<<setup-coommon-functions>>

#+begin_src emacs-lisp :tangle init.el :eval never-export
 (require 'basic-function)
#+end_src
*** Emacs Package 初始化
:PROPERTIES:
:CUSTOM_ID: setup-package
:END:
<<setup-package>>

#+begin_src emacs-lisp :tangle init.el :eval never-export
  ;; This sets up the load path so that we can override it
  (setq warning-suppress-log-types '((package reinitialization)))
  ;; 指定ELPA目录
  (setq package-user-dir (expand-file-name "elpa" "~/.local/share"))
  (add-subdirs-to-load-path package-user-dir t)

  ;; HACK: DO NOT copy package-selected-packages to init/custom file forcibly.
  ;; https://github.com/jwiegley/use-package/issues/383#issuecomment-247801751
  (defun my-save-selected-packages (&optional value)
    "Set `package-selected-packages' to VALUE but don't save to `custom-file'."
    (when value
      (setq package-selected-packages value)))

  (advice-add 'package--save-selected-packages :override #'my-save-selected-packages)

  (require 'package)
  ;;(setq package-archives '(("melpa" . "http://melpa.org/packages/")
  ;;                         ("gnu" . "http://elpa.gnu.org/packages/")
  ;;                         ("nongnu" . "https://elpa.nongnu.org/nongnu/"))

  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/"))
  (add-to-list 'package-archives
               '("org" . "https://orgmode.org/elpa/"))
  (add-to-list 'package-archives
               '("gnu" . "https://elpa.gnu.org/packages/"))
  (add-to-list 'package-archives
               '("nongnu" . "https://elpa.nongnu.org/nongnu/"))

  (setq package-check-signature nil) ; 个别时候会出现签名校验失败

  ;; 初置包官
  ;; (unless (bound-and-true-p package--initialized) ; To avoid warnings in 27
  ;;   (setq package-enable-at-startup nil)          ; To prevent initializing twice
  ;;   (package-initialize))

  (unless (bound-and-true-p package--initialized)
    (package-initialize))

  ;; Should set before loading `use-package'
  ;; make use-package default behavior better
  ;; with `use-package-always-ensure' you won't need ":ensure t" all the time
  ;; with `use-package-always-defer' you won't need ":defer t" all the time
  (setq use-package-always-ensure t
        use-package-always-defer t
        use-package-enable-imenu-support t
        use-package-expand-minimally t)

  ;; Setup `use-package'
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package)
    )

  (require 'use-package)

  ;; On-demand installation of packages
  (defun require-package (&rest packages)
    "Ensure PACKAGES are installed.
   If a package is not installed, it will be installed automatically."
    (dolist (package packages)
      (unless (package-installed-p package)
        (package-install package)))
    (use-package package)
    )

  ;; Compatibility
  (use-package compat :demand t)
#+end_src

*** 加载特定嘅设定文件
:PROPERTIES:
:CUSTOM_ID: load-file-settings
:END:
<<load-file-settings>>

=suk.el= 係由 =M-x org-babel-tangle= (=C-c C-v t=) 命令生成嘅。

*关于 Org 更新嘅贴士:* 我鍾意從已檢出的源代碼運行 Org Mode，而唔係用
package.el。我會將 Lisp 目錄加入我嘅 =load-path= ，同時我都會喺第一次
=use-package org= 呼叫中使用 =:load-path= 選項嚟設置加載路徑。其中一個可能
係有效嘅，另一個可能係多餘嘅，但可能係一種「皮帶加吊帶」嘅做法。由於我
通過 =org-babel-tangle= 生成 =suk.el= ，所以我嘅 Emacs 配置可以喺唔需要先
加載 Org 嘅情況下加載 =suk.el= 。
#+begin_src emacs-lisp :tangle init.el :eval never-export
  (load-if-exists (expand-file-name "suk.el" suk-emacs-root-dir))
  (unless (server-running-p) (server-start))

#+END_SRC

* 我嘅設定
** 個人信息
:PROPERTIES:
:CUSTOM_ID: setup-personal-info
:END:
<<setup-personal-info>>

#+begin_src emacs-lisp :tangle suk.el :eval never-export
  (setq user-full-name "Suk")
  (setq user-mail-address "bruceasu@gmail.com")
#+end_src
** 编辑器设定
:PROPERTIES:
:CUSTOM_ID: setup-editor
:END:
<<setup-editor>>

*** 基本設定
:PROPERTIES:
:CUSTOM_ID: setup-basic
:END:
<<setup-basic>>

#+begin_src emacs-lisp :tangle suk.el :eval never-export
  ;; basic settings
  (setq-default
   major-mode 'text-mode ; 默认使用text模式
   cursor-type 'bar      ; 设置光标样式
   tab-width 4           ; tab 的宽度为 4 空格
   indent-tabs-mode nil  ; 永久使用空格縮排，唔好用 TAB 只係用空格代替
                         ; TAB，使用 C-q TAB 來輸入 TAB 字符
   )
  (tooltip-mode -1)                          ;不要显示任何 tooltips
  (delete-selection-mode 1)                  ;选中文本后输入会覆盖
  (size-indication-mode 1)
  (server-mode 1)
  (global-hl-line-mode 1)                    ;高亮当前行
  (put 'narrow-to-region 'disabled nil)      ;开启变窄区域
  (auto-compression-mode 1)                  ;打开压缩文件时自动解压缩
  (show-paren-mode t)                        ;显示括号匹配
  (setq inhibit-startup-message t)           ; 关闭启动欢迎界面
  (setq inhibit-startup-echo-area-message t) ; 关闭启动时回显区的提示信息
  (setq read-process-output-max #x10000)  ; 64kb.  Increase how much is read from processes in a single chunk (default is 4kb)
  (setq vc-follow-symlinks t)
  (setq font-lock-maximum-decoration t)

  (setq adaptive-fill-regexp "[ t]+|[ t]*([0-9]+.|*+)[ t]*")
  (setq adaptive-fill-first-line-regexp "^* *$")
  (setq set-mark-command-repeat-pop t) ; Repeating C-SPC after popping mark pops it again
  (setq sentence-end "\\([。！？￥%×（）—]\\|……\\|[.?!][]\"')}]*\\($\\|[ \t]\\)\\)[ \t\n]*") ; 测定句子结束识别同埋标点，不用在 `fill` 时，再句号后插入 2 个空行。
  (setq sentence-end-double-space nil)
  (add-hook 'after-change-major-mode-hook (lambda ()(modify-syntax-entry ?_ "w"))) ;; 让 `_` 被视为单词嘅组成部分
  (add-hook 'after-change-major-mode-hook (lambda () (modify-syntax-entry ?- "w"))) ;; `-` 符号同样
  (setq suggest-key-bindings 1)             ;当使用 M-x COMMAND 后，过 1 秒钟显示该 COMMAND 绑定的键。
  (setq browse-kill-ring-quit-action        ;设置退出动作
        (quote save-and-restore))           ;保存还原窗口设置
  (setq max-lisp-eval-depth 4096)           ;lisp最大执行深度
  (setq kill-ring-max 1024)                 ;用一个很大的 kill ring. 这样防止我不小心删掉重要的东西
  (setq mark-ring-max 1024)                 ;设置的mark ring容量
  (setq eval-expression-print-length nil)   ;设置执行表达式的长度没有限制
  (setq eval-expression-print-level nil)    ;设置执行表达式的深度没有限制
  (setq read-quoted-char-radix 16)          ;设置 引用字符 的基数
  (setq global-mark-ring-max 1024)          ;设置最大的全局标记容量
  (setq isearch-allow-scroll t)             ;isearch搜索时是可以滚动屏幕的
  (setq enable-recursive-minibuffers t)     ;minibuffer 递归调用命令
  (setq history-delete-duplicates t)        ;删除minibuffer的重复历史
  (setq minibuffer-message-timeout 2)       ;显示消息超时的时间
  (setq auto-revert-mode 1)                 ;自动更新buffer
  (setq show-paren-style 'parentheses)      ;括号匹配显示但不是烦人的跳到另一个括号。
  (setq message-log-max t)                  ;设置message记录全部消息, 而不用截去
  (setq require-final-newline nil)          ;不自动添加换行符到末尾, 有些情况会出现错误
  (setq ediff-window-setup-function
        (quote ediff-setup-windows-plain))  ;比较窗口设置在同一个frame里
  (setq x-stretch-cursor t)                 ;光标在 TAB 字符上会显示为一个大方块
  (setq print-escape-newlines t)            ;显示字符窗中的换行符为 \n
  (setq tramp-default-method "ssh")         ;设置传送文件默认的方法
  (setq void-text-area-pointer nil)         ;禁止显示鼠标指针
  (setq auto-window-vscroll nil)            ;关闭自动调节行高
  (setq mouse-yank-at-point nil)            ;让光标无法离开视线
  (setq kill-whole-line t)                  ; C-k deletes the end of line
  (setq delete-by-moving-to-trash t)        ; Deleting files go to OS's trash folder
  (setq track-eol t)                        ; Keep cursor at end of lines. Require line-move-visual is nil.
  (setq line-move-visual nil)
  (setq save-interprogram-paste-before-kill t) ; Save clipboard contents into kill-ring before replace them
  (setq echo-keystrokes 0.1)                ;加快快捷键提示的速度

  ;; Hanlde minified code
  (if emacs/>=27p
      (add-hook 'after-init-hook #'global-so-long-mode))

  ;; 如果有两个重名buffer, 则再前面加上路径区别
  (require 'uniquify)
  (with-eval-after-load 'uniquify
    ;; (setq uniquify-buffer-name-style 'forward)
    (setq uniquify-buffer-name-style 'post-forward-angle-brackets)
    )
  (if (boundp 'use-short-answers)
      (setq use-short-answers t)
    (fset 'yes-or-no-p 'y-or-n-p))

#+end_src
*** 備份設定
:PROPERTIES:
:CUSTOM_ID: setup-backup
:END:
<<setup-backup>>

#+begin_src emacs-lisp :tangle suk.el :eval never-export
  ;; backup settings
  (setq make-backup-files t)
  (setq version-control t)     ; 允许多次备份
  (setq kept-old-versions 2)   ; 保留最早的2个备份文件
  (setq kept-new-version 100)  ; 保留最近的100个备份文件
  (setq delete-old-versions t) ; 自动删除旧的备份文件
#+end_src
*** 歴史
:PROPERTIES:
:CUSTOM_ID: setup-history
:END:
<<setup-history>>

#+begin_src emacs-lisp :tangle suk.el
  (setq enable-recursive-minibuffers t ; Allow commands in minibuffers
        history-length 1000
        savehist-additional-variables '(mark-ring
                                        global-mark-ring
                                        search-ring
                                        regexp-search-ring
                                        extended-command-history)
        savehist-autosave-interval 300
        savehist-file (expand-file-name "history" suk-emacs-var-dir) ; "~/.emacs.d/var/history"
        )
  (savehist-mode 1)
#+end_src
*** 編碼設定
:PROPERTIES:
:CUSTOM_ID: setup-charset
:END:
<<setup-charset>>
#+begin_src emacs-lisp :tangle suk.el

  ;; 重要提示:写在最后一行的，实际上最优先使用; 最前面一行，反而放到最后才识别。
  ;; utf-16le-with-signature 相当于 Windows 下的 Unicode 编码，这里也可写成
  ;; utf-16 (utf-16 ham:  utf-16le, utf-16be, utf-16le-with-signature dang)
  ;; Unicode
  ;; (prefer-coding-system 'utf-16le-with-signature)
  ;; (prefer-coding-system 'utf-16)
  ;; (prefer-coding-system 'utf-8-dos)
  
  ;; Set UTF-8 as the default coding system
  (prefer-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8)            ;缓存文件编码
  (setq default-file-name-coding-system 'utf-8)              ;文件名编码
  (setq default-keyboard-coding-system 'utf-8)               ;键盘输入编码
  (setq default-process-coding-system '(utf-8 . utf-8))      ;进程输出输入编码
  (setq default-sendmail-coding-system 'utf-8)               ;发送邮件编码
  (setq default-terminal-coding-system 'utf-8)               ;终端编码


  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq-default buffer-file-coding-system 'utf-8)

  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)

  (setq buffer-file-coding-system 'utf-8)
  (setq session-save-file-coding-system 'utf-8)

  (set-language-environment "UTF-8")

  (prefer-coding-system 'utf-8)
#+end_src
** 伺机加载 Lazy Load
:PROPERTIES:
:CUSTOM_ID: setup-lazy-load
:END:
<<setup-lazy-load>>

- 全局 lazy-load-global-keys
- 模式 lazy-load-local-keys

支持最后一个参数传递前缀按键，

如果 Emacs 默认已经加载咗某个插件，而唔需要喺运行时动态加载，都可以使
用 lazy-load-set-keys

好多全局按键默认已经被 Emacs 占用咗，必须先卸载先可以重新绑定啲全局按
键，例如 Ctrl + x，下面呢段代码就系用 lazy-load-unset-keys 卸载默认绑
定嘅全局按键。

#+begin_example
 ;;; --- 卸载按键
 (lazy-load-unset-keys ;全局按键的卸载
  '("C-z" "C-x"  "s-W" "s-z" "M-h" "C-\\" "s-c" "s-x" "s-v"))

  
(lazy-load-global-keys
 '(("M-g" . goto-line-preview))
 "goto-line-preview")

 
(lazy-load-local-keys
 '(("C-c t" . ruby-hash-syntax-toggle))
 ruby-mode-map
 "ruby-extension")

 (lazy-load-global-keys
 '(("p" . sdcv-search-pointer)
   ("y" . sdcv-search-pointer+)
   ("i" . sdcv-search-input)
   (";" . sdcv-search-input+))
 "init-sdcv"
 "C-z")

 ;; Mac平台下交换 Option 和 Command 键。

  (when (featurep 'cocoa)
    (setq mac-option-modifier 'super)
    (setq mac-command-modifier 'meta))

#+end_example

#+begin_src emacs-lisp :tangle etc/init-key.el
  (require 'lazy-load)
  (provide 'init-key)
  ;;; ### Unset key ###
  ;;; --- 卸载按键
  (lazy-load-unset-keys                   ;全局按键的卸载
   ;; '("C-z"  "s-W" "s-z" "M-h" "C-\\" "s-c" "s-x" "s-v"))
   '("C-z" ))

#+end_src
Add to suk.el
#+begin_src emacs-lisp :tangle suk.el
  (require 'init-key)
#+end_src

** 何以快键 How to set keys
