README.org
*** Bindkeys examples
通用定义方法
#+begin_example
(define-prefix-command 'my-leader)           ;设定leader
(define-key keymap "keystrok" 'command-name) ;将快捷键绑定到 leader按键后，即和键位图绑定。
(global-set-key "keystroke" 'command-name)   ;定义全局快捷键
(local-set-key  "keystroke" 'command-name)   ;定义局部快捷键
#+end_example
通用移除定义方法
#+begin_example
;; remove a keybinding
;; for emacs 29 or after
(keymap-global-set "C-t" nil)
;; or use
(keymap-global-unset "C-t")
;; before emacs 28 or before
(global-set-key (kbd "C-t") nil)
;; or
(global-unset-key (kbd "C-t"))

#+end_example
例子：
#+begin_src emacs-elisp :tangle achrives-and-examples.el

;;注意：keystroke中的Control 和 Alternative使用\C, \M表示。
;;如果是kbd函数，可以使用C和M表示

;; global-set-key examples:
(global-set-key (kbd "C-x C-\\") 'next-line)
(global-set-key [?\C-x ?\C-\\] 'next-line)
(global-set-key [(control ?x) (control ?\\)] 'next-line)
(keymap-global-set [(control ?x) (control ?\\)] 'next-line)
(keymap-set global-map "C-x" 'next-line)



;; 方式一：
(define-prefix-command 'SPC-map)
(global-set-key (kbd "SPC") 'SPC-map)
(global-set-key (kbd "SPC f") 'find-file)

;; 方式二：
(define-prefix-command 'SPC-map)
(global-set-key (kbd "SPC") #'SPC-map)
(define-key SPC-map (kbd "f") #'find-file)


;; 演示了如何定义一个新的按键前缀. 这里定义了M-c作为按键前缀.
(define-prefix-command 'comm-map)
(global-set-key (kbd "M-c") 'comm-map)
(global-set-key [(meta c)]  'comm-map)

;; 演示了如何在一个模式下(这里是isearch模式), 定义快捷键.
;; 退出isearch-mode, 所有按键失效.
(add-hook
  'isearch-mode-hook
  '(lambda ()
   
    ;; 单词搜索
    (local-set-key [(meta w)] 'isearch-forward-word)
    (local-set-key [(meta s)] 'isearch-repeat-forward)
    ))
 ;; 搜索下一个结果
    (define-key isearch-mode-map [(meta n)] 'isearch-repeat-forward)
    ;; 搜索前一个结果
    (define-key isearch-mode-map [(meta p)] 'isearch-repeat-backward)
    ;; 替换
    (define-key isearch-mode-map [(control r)] 'isearch-query-replace)
    ;; 正则替换
    (define-key isearch-mode-map [(meta 5)] 'isearch-query-replace-regexp)
    (define-key isearch-mode-map [(meta f)] 'isearch-yank-word-or-char)
    ;; 剪切板作为搜索内容
    (define-key isearch-mode-map [(meta y)] 'isearch-yank-kill)
    ;; 将光标到行尾作为搜索内容
    (define-key isearch-mode-map [(meta k)] 'isearch-yank-line)
    (define-key isearch-mode-map [(hyper l)] 'isearch-yank-char)
    ;; 向左或向右(选择/取消)单个字符作为搜索内容
    (define-key isearch-mode-map [(hyper j)] 'isearch-delete-char)
    ;; 显示occur视图
    (define-key isearch-mode-map [(meta o)] 'isearch-occur)
#+END_SRC

keymap 定义

直接定义全局快捷键：
:  (global-set-key (kbd "C-c n d") #'denote)

自己定义 keymap 其实很简单的，使用 defvar-keymap ，可以从上面的配置中
抽取 C-c n 作为一个 prefix key ，定义如下：
#+BEGIN_EXAMPLE
(defvar-keymap hsk/notetaking-map
  :doc "My notetaking keymap"
  "d" #'denote
  "t" #'denote-keywords-add
  "T" #'denote-keywords-remove)
#+END_EXAMPLE
或者使用旧方法
#+begin_example
(define-prefix-command hsk/notetaking-map)
(define-key hsk/notetaking-map (kbd "d") #'denote)
(define-key hsk/notetaking-map (kbd "t") #'isearch-repeat-forward)
#+end_example
然后就可以用：
: (global-set-key (kbd "C-c n") hsk/notetaking-map)

来将上面定义的 keymap 绑定到 C-c n 上。不过从 emacs-29 开始，更推荐用
keymap-set ，上面的代码可以改成：
: (keymap-set global-map "C-c n" hsk/notetaking-map)
: (keymap-global-set "C-c n" hsk/notetaking-map)

省去了 (kbd ...) 这一层，比较方便。

比起原先每个快捷键单独定义，使用 keymap 好处是便于管理，比如之后我想更
换快捷键前缀，从 C-c n 换成 C-c C-n ，只要改一处 keymap-set 就可以了。

另一个优点是可以嵌套定义，比如我想要将 org-journal 相关的操作也挂到
hsk/notetaking-map 下面，可以先定义一个 hsk/org-journal-map：
#+BEGIN_EXAMPLE
  (defvar-keymap hsk/org-journal-map
  :doc "My org-journal keymap"
  "n" #'org-journal-new-entry
  "s" #'org-journal-search
  "o" #'org-journal-open-current-journal-file)
#+END_EXAMPLE


然后将它嵌套进另一个 map 下面：
#+BEGIN_EXAMPLE
  (defvar-keymap hsk/notetaking-map
  :doc "My notetaking keymap"
  ;;...
  "j" hsk/org-journal-map)
#+END_EXAMPLE

这样 org-journal-new-entry 就映射到 C-c n j n 上了，非常优雅。

: (let ((my-keymap (make-sparse-keymap))) ; 创建一个空的 keymap
:  (keymap-set my-keymap "C-c f" 'find-file)) ; 设置 C-c f 来执行 'find-file 命令
: (keymap-local-set "C-p" ctl-x-map)


*** bind-keys
是由 use-package 宏提供的一个功能，允许在一个声明中绑定多个
键。虽然bind-keys 可以独立于 use-package 使用，但它通常与 use-package
结合使用，以提供更清晰和模块化的键绑定配置。
我个人是认为他比Emacs新定义的keymap-XXX 系列的实现要好。

#+begin_src emacs-lisp :tangle suk.el
  (use-package bind-key)
  ;;(bind-key "C-c x" #'some-function some-package-mode-map)
  ;;(bind-key "C-c y" #'another-function)

  ;; (bind-keys
  ;;  ("C-x C-c" . save-buffers-kill-terminal)
  ;;  ("C-x C-f" . find-file)
  ;;  ("C-x C-s" . save-buffer))

  ;; (bind-keys :map python-mode-map
  ;;            ("C-c C-c" . python-shell-send-buffer)
  ;;            ("C-c C-r" . python-shell-send-region))


  ;; Toggle fullscreen <F11> also bind to fullscreen
  (bind-keys ("C-<f11>" . toggle-frame-fullscreen)
             ("C-S-f" . toggle-frame-fullscreen) ; Compatible with macOS
             ("M-S-<return>" . toggle-frame-fullscreen) ; Compatible with Windos
             )
#+end_src

*** Some Global keys
#+begin_src emacs-lisp :tangle suk.el

  (global-set-key (kbd "C-x R") 'recentf-open)    ;; 快捷键 C-x R 用于打开最近文件
  (if (display-graphic-p)
      (global-set-key (kbd "<escape>") 'keyboard-escape-quit))

  (when emacs/>=29p
    ;; (keymap-global-set <key> <cmmd>)
    (keymap-set global-map "C-<f11>" #'toggle-frame-fullscreen)       ;; 快捷键 C-<f11> 用于切换全屏模式
    (keymap-set global-map "M-s-<return>" #'toggle-frame-fullscreen)  ;; 快捷键 M-S-<return> 也用于切换全屏模式
    (keymap-set global-map "RET" #'newline-and-indent)                ;; 回车键 RET 用于创建新行并对齐
    (keymap-set global-map "S-<return>" #'comment-indent-new-line)    ;; Shift + 回车键用于取消对齐创建的新行
    ) 
  (unless emacs/>=29p
    (global-set-key (kbd "C-<f11>") 'toggle-frame-fullscreen)      ;; 快捷键 C-<f11> 用于切换全屏模式
    (global-set-key (kbd "M-s-<return>") 'toggle-frame-fullscreen)
    (global-set-key (kbd "RET") #'newline-and-indent)              ;; 回车键 RET 用于创建新行并对齐
    (global-set-key (kbd "S-<return>") #'comment-indent-new-line)  ;; Shift + 回车键用于取消对齐创建的新行
    )

  (global-set-key  (kbd "C-S-SPC") 'set-mark-command)

  (define-prefix-command 'leader-key)
  (global-set-key (kbd "S-SPC") 'leader-key)
  (keymap-set leader-key "f" #'toggle-frame-fullscreen) ;; full screen
  ;;; ### Toolkit ###
  ;;; --- 工具函数
  (lazy-load-set-keys
   '(
     ("C-," . bury-buffer)                ;隐藏当前buffer
     ("C-." . unbury-buffer)              ;反隐藏当前buffer
     ("C-<f12>" . lazycat-theme-toggle)
     )
   (current-global-map)
   "C-z"
   )

  ;; 一啲方便嘅函数
  ;; 用于向后跳跃到上一个 sexp C-M-<left> / ESC C-<left>
  ;; 用于向前跳跃到下一个 sexp C-M-<right> / ESC C-<right>
  ;; eval-expression 执行表达式 M-: M-ESC :
  ;; sort-lines, calendar, align-regexp
  ;; C-t transpose-char M-t tanspose-word
  ;; toggle-truncate-lines C-x x t
  ;; C-c TAB indent-region
  ;; C-u C-c TAB => (un)indent-region

  ;; M-x global-set-key RET 交互式的绑定你的键。
  ;; C-x Esc Esc 调出上一条“复杂命令”

  ;;Emacs 自动排版
  ;;很简单：C-x h C-M-\
  ;;其中C-x h 是全选
  ;;C-M-\ 是排版

  ;; C-x C-q set/unset readonly
  ;; 大小写转换： M-u, M-l, M-c

  ;; M-x align-regexp 可以方便的对齐一些文字

#+end_src

** Toggles
使用Hydra提供一组设定常用开发的工具,减少输入或者快捷键的定义
#+begin_src emacs-lisp :tangle suk.el
  (with-eval-after-load 'pretty-hydra
    ;; Global toggles
    (with-no-warnings
      (pretty-hydra-define+ toggles-hydra (:title (pretty-hydra-title "Toggles" 'faicon "nf-fa-toggle_on") :color amaranth :quit-key ("q" "C-g"))
        ("Basic"
         (("n" (cond ((fboundp 'display-line-numbers-mode)
                      (display-line-numbers-mode (if display-line-numbers-mode -1 1)))
                     ((fboundp 'gblobal-linum-mode)
                      (global-linum-mode (if global-linum-mode -1 1))))
           "line number"
           :toggle (or (bound-and-true-p display-line-numbers-mode)
                       (bound-and-true-p global-linum-mode)))
          ("i" global-aggressive-indent-mode "aggressive indent" :toggle t)
          ("d" global-hungry-delete-mode "hungry delete" :toggle t)
          ("e" electric-pair-mode "electric pair" :toggle t)
          ("c" flyspell-mode "spell check" :toggle t)
          ("s" prettify-symbols-mode "pretty symbol" :toggle t)
          ("l" global-page-break-lines-mode "page break lines" :toggle t)
          ("B" display-battery-mode "battery" :toggle t)
          ("T" display-time-mode "time" :toggle t)
          ("a" abbrev-mode "abrev" :toggle t)
          ("F" auto-fill-mode "auto fill" :toggle t)
          ("m" doom-modeline-mode "modern mode-line" :toggle t)
          ("t" toggle-truncate-lines "truncate lines" :toggle t)
          ("u" toggle-company-ispell "Company Ispell" :toggle t))
         "Highlight"
         (("h l" global-hl-line-mode "line" :toggle t)
          ("h p" show-paren-mode "paren" :toggle t)
          ("h s" symbol-overlay-mode "symbol" :toggle t)
          ("h r" rainbow-mode "rainbow" :toggle t)
          ("h w" (setq-default show-trailing-whitespace (not show-trailing-whitespace))
           "whitespace" :toggle show-trailing-whitespace)
          ("h d" rainbow-delimiters-mode "delimiter" :toggle t)
          ("h i" highlight-indent-guides-mode "indent" :toggle t)
          ("h t" global-hl-todo-mode "todo" :toggle t))
         "Program"
         (("f" flymake-mode "flymake" :toggle t)
          ("O" hs-minor-mode "hideshow" :toggle t)
          ("U" subword-mode "subword" :toggle t)
          ("w" whitespace-mode "whitespace" :toggle t)
          ("W" which-function-mode "which function" :toggle t)
          ("E" toggle-debug-on-error "debug on error" :toggle (default-value 'debug-on-error))
          ("Q" toggle-debug-on-quit "debug on quit" :toggle (default-value 'debug-on-quit))
          ("v" global-diff-hl-mode "gutter" :toggle t)
          ("V" diff-hql-flydiff-mode "live gutter" :toggle t)
          ("M" diff-hl-margin-mode "margin gutter" :toggle t)
          ("D" diff-hl-dired-mode "dired gutter" :toggle t))
         ))
      ;; (keymap-global-set "C-x M-t"  #'toggles-hydra/body)
      (keymap-set leader-key "t" #'toggles-hydra/body)
  ))

#+end_src
** Move cursor

#+begin_src emacs-lisp :tangle suk.el
  ;;; ### goto-line-preview ###
  (lazy-load-global-keys
   '(
     ("g p" . goto-line-preview))
   "goto-line-preview"
   "C-z")

  ;;; ### basic-toolkit ###
  (lazy-load-global-keys
   '(
     ("g c" . goto-column)                ;到指定列
     ("g p" . goto-percent)               ;跳转到当前Buffer的文本百分比, 单位为字符
     )
   "basic-toolkit"
   "C-z")

  (lazy-load-global-keys
   '(
     ("C-x r ," . remember-init)    ;记忆初始函数
     ("C-x r ." . remember-jump)    ;记忆跳转函数
     ("C-x r <" . point-stack-pop)  ;buffer索引跳转
     ("C-x r >" . point-stack-push) ;buffer索引标记
     )
   "my-bookmak"
   "C-z"
   )

  ;;; --- 滚动其他窗口

  ;; 下面这两个键模拟Vi的光标不动屏幕动效果, 我很喜欢, 几乎总在使用.
  ;;(global-set-key [(meta N)] 'window-move-up)        
  ;;(global-set-key [(meta P)] 'window-move-DOWN)

  ;; 同上, 但是是另一个buffer窗口上下移动. 常常查看帮助用这个.
  ;;(global-set-key [(control N)] 'other-window-move-up)
  ;;(global-set-key [(control P)] 'other-window-move-down) 
  (lazy-load-global-keys
   '(
     ("M-N" . other-window-move-up)   ;向下滚动其他窗口  scroll-other-window-up
     ("M-P" . other-window-move-down) ;向上滚动其他窗口  scroll-other-window-down
     ("M-n" . window-move-up)         ;向下滚动当前窗口  scroll-up
     ("M-p" . window-move-down)       ;向上滚动当前窗口  scroll-down
     )
   "win-move")
#+end_src

** Move text
#+begin_src emacs-lisp :tangle etc/init-key.el
  ;;; ### move text ###
  (lazy-load-global-keys
   '(
     ("C-S-n" . move-text-down) ;把光标所在的整行文字(或标记)下移一行
     ("C-S-p" . move-text-up)   ;把光标所在的整行文字(或标记)上移一行
     ("C-S-<down>" . move-text-down)  ;把光标所在的整行文字(或标记)下移一行
     ("C-S-<up>"   . move-text-up)    ;把光标所在的整行文字(或标记)上移一行
     )
   "move-text")

  ;;; ### move comment ###
  (lazy-load-global-keys
   '(
     ("M-s-n" . comment-part-move-down)   ;向下移动注释
     ("M-s-p" . comment-part-move-up)     ;向上移动注释
     ("C-s-n" . comment-dwim-next-line)   ;移动到上一行并注释
     ("C-s-p" . comment-dwim-prev-line)   ;移动到下一行并注释
     )
   "move-comment")
#+end_src

** Open new line
#+begin_src emacs-lisp :tangle etc/init-key.el
  ;;; ### open new line ###
  (lazy-load-global-keys
   '(
     ("C-o" . open-newline-above) ;在上面一行新建一行
     ("C-l" . open-newline-below) ;在下面一行新建一行
     )
   "open-newline")
#+end_src
** Duplicate line
#+begin_src emacs-lisp :tangle etc/init-key.el
  ;; ### duplicate-line ###
  (lazy-load-global-keys
   '(
     ("C-S-o" . duplicate-line-or-region-above) ;向上复制当前行或区域
     ("C-S-l" . duplicate-line-or-region-below) ;向下复制当前行或区域
     ("C-S-s-o" . duplicate-line-above-comment) ;复制当前行到上一行, 并注释当前行
     ("C-S-s-l" . duplicate-line-below-comment) ;复制当前行到下一行, 并注释当前行
     ("C-:" . comment-or-uncomment-region+)     ;注释当前行
     )
   "duplicate-line")
#+end_src
** Delete to character
#+begin_src emacs-lisp :tangle etc/init-key.el
;; 自定义删除到字符函数
(defun my/delete-to-char (char)
  "删除光标位置到下一个出现的字符 CHAR 之间的所有内容（不包括 CHAR 本身）。"
  (interactive "cDelete to char: ")
  (let ((start (point))
        (end (progn
               (search-forward (char-to-string char) (line-end-position) t))))
    (if end
        (progn
          (goto-char end)
          (delete-region start (- end 1))
          (message "Deleted from %d to %d" start (- end 1)))
      (progn
        (delete-region start (line-end-position))
        (message "Character '%c' not found. Deleted to end of line." char)))))

;; 绑定快捷键 C-c d 到 my/delete-to-char 函数
(global-set-key (kbd "C-c d") 'my/delete-to-char)
#+end_src
