etc/init-key.el
   ("C-S-n" . move-text-down) ;把光标所在的整行文字(或标记)下移一行
   ("C-S-p" . move-text-up)   ;把光标所在的整行文字(或标记)上移一行
   ("C-S-<down>" . move-text-down)  ;把光标所在的整行文字(或标记)下移一行
   ("C-S-<up>"   . move-text-up)    ;把光标所在的整行文字(或标记)上移一行
   )
 "move-text")

;;; ### move comment ###
(lazy-load-global-keys
 '(
   ("M-s-n" . comment-part-move-down)   ;向下移动注释
   ("M-s-p" . comment-part-move-up)     ;向上移动注释
   ("C-s-n" . comment-dwim-next-line)   ;移动到上一行并注释
   ("C-s-p" . comment-dwim-prev-line)   ;移动到下一行并注释
   )
 "move-comment")

;;; ### open new line ###
(lazy-load-global-keys
 '(
   ("C-o" . open-newline-above) ;在上面一行新建一行
   ("C-l" . open-newline-below) ;在下面一行新建一行
   )
 "open-newline")

;; ### duplicate-line ###
(lazy-load-global-keys
 '(
   ("C-S-o" . duplicate-line-or-region-above) ;向上复制当前行或区域
   ("C-S-l" . duplicate-line-or-region-below) ;向下复制当前行或区域
   ("C-S-s-o" . duplicate-line-above-comment) ;复制当前行到上一行, 并注释当前行
   ("C-S-s-l" . duplicate-line-below-comment) ;复制当前行到下一行, 并注释当前行
   ("C-:" . comment-or-uncomment-region+)     ;注释当前行
   )
 "duplicate-line")

;; 自定义删除到字符函数
(defun my/delete-to-char (char)
  "删除光标位置到下一个出现的字符 CHAR 之间的所有内容（不包括 CHAR 本身）。"
  (interactive "cDelete to char: ")
  (let ((start (point))
        (end (progn
               (search-forward (char-to-string char) (line-end-position) t))))
    (if end
        (progn
          (goto-char end)
          (delete-region start (- end 1))
          (message "Deleted from %d to %d" start (- end 1)))
      (progn
        (delete-region start (line-end-position))
        (message "Character '%c' not found. Deleted to end of line." char)))))

;; 绑定快捷键 C-c d 到 my/delete-to-char 函数
(global-set-key (kbd "C-c d") 'my/delete-to-char)
