README.org
** Insert template
#+begin_src emacs-lisp :tangle suk.el
  ;;;###autoload
  (defun insert-hash-template ()
    "插入HASH模板：
  #=================================================
  # <cursor>
  #-------------------------------------------------
  光标位于第二行的 # 后面。"
    (interactive)
    (beginning-of-line) 
    (insert "#=================================================\n")
    (insert "# \n")
    (insert "#-------------------------------------------------\n")
    ;; 将光标移动到第二行的 # 后面
    (forward-line -2)          ; 移动到上一行（即第二行）
    (end-of-line)              ; 移动到行尾

    )

  ;;;###autoload
  (defun insert-slash-template ()
    "插入Slash comment模板：
  #=================================================
  # <cursor>
  #-------------------------------------------------
  光标位于第二行的 // 后面。"
    (interactive)
    (beginning-of-line) 
    (insert "//=================================================\n")
    (insert "// \n")
    (insert "//-------------------------------------------------\n")
    ;; 将光标移动到第二行的 # 后面
    (forward-line -2)          ; 移动到上一行（即第二行）
    (end-of-line)              ; 移动到行尾
    )


  ;;;###autoload
  (defun insert-star-template ()
    "插入Slash comment模板：
  #=================================================
  # <cursor>
  #-------------------------------------------------
  光标位于第二行的 # 后面。"
    (interactive)
    (beginning-of-line) 
    (insert "/*=================================================*/\n")
    (insert "/*  */\n")
    (insert "/*-------------------------------------------------*/\n")
    (forward-line -2)         
    (end-of-line)          
    (backward-char 3)      
    )

  ;;;###autoload
  (defun insert-javadoc-template ()
    "插入Javadoc模板：
  #=================================================
  # <cursor>
  #-------------------------------------------------
  光标位于第二行的 * 后面。"
    (interactive)
    (beginning-of-line) 
    (insert "/**\n")
    (insert " * \n")
    (insert " */\n")
    (forward-line -2)       
    (end-of-line)         
    )

  ;; 绑定快捷键 C-c t 到插入自定义模板的函数
  (global-set-key (kbd "C-c t h") 'insert-hash-template)
  (global-set-key (kbd "C-c t c") 'insert-slash-template)
  (global-set-key (kbd "C-c t s") 'insert-star-template)
  (global-set-key (kbd "C-c t j") 'insert-javadoc-template)

#+end_src

** Word Styles
#+begin_src emacs-lisp :tangle etc/init-key.el
  ;; ### String Inflection ###
  ;; --- 单词语法风格快速转换

   ;;; ### basic-toolkit ###
  (lazy-load-global-keys
   '(
     ("M-l" . downcase-char)
     ("M-u" . upcase-char)
     )
   "cases")
#+end_src
** Thing Edit
#+begin_src emacs-lisp :tangle etc/init-key.el
  ;;; ### Thing-edit ###
  ;;; --- 增强式编辑当前光标的对象 
  (lazy-load-global-keys
   '(
     ;; ("C-c w" . thing-copy-word)
     ;; ("C-c s" . thing-copy-symbol)
     ;; ("C-c m" . thing-copy-email)
     ;; ("C-c f" . thing-copy-filename)
     ;; ("C-c u" . thing-copy-url)
     ;; ("C-c x" . thing-copy-sexp)
     ;; ("C-c g" . thing-copy-page)
     ;; ("C-c t" . thing-copy-sentence)
     ;; ("C-c o" . thing-copy-witespace)
     ;; ("C-c i" . thing-copy-list)
     ;; ("C-c c" . thing-copy-comment)
     ;; ("C-c h" . thing-copy-defun)
     ;; ("C-c p" . thing-copy-parentheses)
     ;; ("C-c l" . thing-copy-line)
     ;; ("C-c a" . thing-copy-to-line-begining)
     ;; ("C-c e" . thing-copy-to-line-end)

     ;; ("C-c W" . thing-cut-word)
     ;; ("C-c S" . thing-cut-symbol)
     ;; ("C-c M" . thing-cut-email)
     ;; ("C-c F" . thing-cut-filename)
     ;; ("C-c G" . thing-cut-page)
     ;; ("C-c T" . thing-cut-sentence)
     ;; ("C-c O" . thing-cut-whitespace)
     ;; ("C-c I" . thing-cut-list)
     ;; ("C-c C" . thing-cut-comment)
     ;; ("C-c H" . thing-cut-defun)
     ;; ("C-c P" . thing-cut-parentheses)
     ;; ("C-c L" . thing-cut-line)
     ;; ("C-c A" . thing-cut-to-line-beginning)
     ;; ("C-c E" . thing-cut-to-line-end)
     ("S-SPC e" . hydra-thing-edit/body)
     ("C-c e" . hydra-thing-edit/body)
     )
   "init-thing-edit"
   )


#+end_src

** Buffer Edit
#+begin_src emacs-lisp :tangle etc/init-key.el
  ;; ### Buffer Edit ### 
  ;; --- 缓存编辑
  (lazy-load-set-keys
   '(
     ("C-x C-x" . exchange-point-and-mark)   ;交换当前点和标记点
     ("M-o" . backward-delete-char-untabify) ;向前删除字符
     ("C-M-S-h" . mark-paragraph)            ;选中段落
     ("M-SPC" . just-one-space)              ;只有一个空格在光标处
     ))
  ;;; ### basic-toolkit ###
  (lazy-load-global-keys
   '(
     ;;("M-2" . indent-buffer)              ;自动格式化当前Buffer
     ;; indent-comment-buffer
     ;;("C-x u" . mark-line)              ;选中整行
     ("s-k" . kill-and-join-forward)      ;在缩进的行之间删除
     ;;("" . strip-blank-lines)             ; 删除空行
     ;; strip-line-number
     ;; delete-chars-hungry-forward
     ;; delete-chars-hungry-backward
     ;; underline-line-with
     ;; current-line-move-to-top
     ("<f2>" . refresh-file)              ;自动刷新文件
     ("C-S-j" . join-lines)               ;连接下行
     ("M-q" . suk/fill-or-unfill-paragraph)
     ("C-x n N" . suk/xah-narrow-to-region)
     )
   "basic-toolkit")
#+end_src


** Insert translated name
#+begin_src emacs-lisp :tangle suk-unload.el
  ;;; ### Insert translated name ###
  ;; youdao / google
  (setq insert-translated-name-translate-engine "google")
  (lazy-load-global-keys
   '(
     ("," . insert-translated-name-insert-with-underline)
     ("." . insert-translated-name-insert-with-camel)
     ("/" . insert-translated-name-insert)
     )
   "insert-translated-name"
   "C-z"
   )
#+end_src
** Description Keys
=F1 + {f/k/d/i/k}= 或者  =C-h {f/k/d/i}= 可以打开相关帮助
Use ~C-c C-h~ to open the description menu 

#+begin_src emacs-lisp :tangle suk.el

  ;;;###autoload
  (with-eval-after-load 'hydra
    (defhydra my-hydra-describe (:color blue :hint nil)
      "
  Describe Something: (q to quit)
  _a_ all help for everything screen
  _b_ bindings
  _c_ char
  _C_ coding system
  _f_ function
  _i_ input method
  _k_ key briefly
  _K_ key
  _l_ language environment
  _m_ major mode
  _M_ minor mode
  _n_ current coding system briefly
  _N_ current coding system full
  _o_ lighter indicator
  _O_ lighter symbol
  _p_ package
  _P_ text properties
  _s_ symbol
  _t_ theme
  _v_ variable
  _w_ where is something defined
  "
      ("b" describe-bindings)
      ("C" describe-categories)
      ("c" describe-char)
      ("C" describe-coding-system)
      ("f" describe-function)
      ("i" describe-input-method)
      ("K" describe-key)
      ("k" describe-key-briefly)
      ("l" describe-language-environment)
      ("M" describe-minor-mode)
      ("m" describe-mode)
      ("N" describe-current-coding-system)
      ("n" describe-current-coding-system-briefly)
      ("o" describe-minor-mode-from-indicator)
      ("O" describe-minor-mode-from-symbol)
      ("p" describe-package)
      ("P" describe-text-properties)
      ("q" nil)
      ("a" help)
      ("s" describe-symbol)
      ("t" describe-theme)
      ("v" describe-variable)
      ("w" where-is))
    (keymap-global-set "S-SPC h" #'my-hydra-describe/body))
#+end_src
** Rectangle
记录一下使用方法
- =C-x r k=  Kill the text of the region-rectangle, saving its contents as the last killed rectangle (kill-rectangle).
- =C-x r M-w= Save the text of the region-rectangle as the last killed rectangle (copy-rectangle-as-kill).
- =C-x r d= Delete the text of the region-rectangle (delete-rectangle).
- =C-x r y= Yank the last killed rectangle with its upper left corner at point (yank-rectangle).
- =C-x r o= Insert blank space to fill the space of the region-rectangle (open-rectangle). This pushes the previous contents of the region-rectangle to the right.
- =C-x r N= Insert line numbers along the left edge of the region-rectangle (rectangle-number-lines). This pushes the previous contents of the region-rectangle to the right.
- =C-x r c= Clear the region-rectangle by replacing all of its contents with spaces (clear-rectangle).
- =M-x delete-whitespace-rectangle= Delete whitespace in each of the lines on the specified rectangle, starting from the left edge column of the rectangle.
- =C-x r t string <RET>=  Replace rectangle contents with string on each line (string-rectangle).
-  =M-x string-insert-rectangle <RET> string <RET>= Insert string on each line of the rectangle.
-  =C-x <SPC>= Toggle Rectangle Mark mode (rectangle-mark-mode). When
  this mode is active, the region-rectangle is highlighted and can be
  shrunk/grown, and the standard kill and yank commands operate on it.
  The rectangle operations fall into two classes: commands to erase or
  insert rectangles, and comm
#+begin_src emacs-lisp :tangle suk.el
   ;;; Rectangle
  (lazy-load-global-keys
   '(
     ("r" . hydra-rectangle/body)
     )
   "init-rectangle"
   "C-z"
   )
#+end_src
** Expand region
#+begin_src emacs-lisp :tangle suk.el
  ;; expand-region
  (run-with-idle-timer
   2 nil
   #'(lambda()
       ;; (use-package expand-region ; I prefer stable version
       ;;    :load-path "~/.emacs.d/extensions/expand-region"
       ;; )
       (with-eval-after-load 'expand-region
          (defun treesit-mark-bigger-node ()
             "Use tree-sitter to mark regions."
             (let* ((root (treesit-buffer-root-node))
                    (node (treesit-node-descendant-for-range root (region-beginning) (region-end)))
                    (node-start (treesit-node-start node))
                    (node-end (treesit-node-end node)))
               ;; Node fits the region exactly. Try its parent node instead.
               (when (and (= (region-beginning) node-start) (= (region-end) node-end))
                 (when-let ((node (treesit-node-parent node)))
                   (setq node-start (treesit-node-start node)
                         node-end (treesit-node-end node))))
               (set-mark node-end)
               (goto-char node-start)))
          )))

#+end_src
Add shortcut.
#+begin_src emacs-lisp :tangle etc/init-key.el
  (lazy-load-global-keys
         '(("M-=" . er/expand-region)
           ("M--" . er/contract-region)
           ("M-S-<Right>" . er/expand-region)
           ("M-S-<Left>" . er/contract-region)
           )
         "expand-region")
#+end_src
** Undo
#+begin_src emacs-lisp :tangle suk.el
  ;; Treat undo history as a tree, ^x u
  (run-with-idle-timer
   2 nil
   #'(lambda()
         (if emacs/>=28p
             (progn
               ;; vundo :load-path "~/.emacs.d/extensions/vundo"
               ;; (requir 'vundo)
               (with-eval-after-load 'vundo
                 (setq vundo-glyph-alist vundo-unicode-symbols)))
           (progn
             (setq undo-tree-visualizer-timestamps t
                   undo-tree-visualizer-diff t
                   undo-tree-enable-undo-in-region nil
                   undo-tree-auto-save-history nil)
             ;; HACK: keep the diff window
             (with-no-warnings
               (make-variable-buffer-local 'undo-tree-visualizer-diff)
               (setq-default undo-tree-visualizer-diff t))
             (with-eval-after-load 'undo-tree
               (add-hook 'after-init-hook #'global-undo-tree-mode))
             ))
         ))
#+end_src
Add shortcuts.
#+begin_src emacs-lisp :tangle etc/init-key.el
  (if emacs/>=28p
      (lazy-load-global-keys
       '(("C-x u" . vundo)
         ("C-/" . vundo)
         )
       "vundo")
    (lazy-load-global-keys
     '(("C-x u" . undo-trees)
       ("C-/"   . undo-tree-undo)
       ("C-?  " . undo-tree-redo)
       )
     "undo-tree")
    )
#+end_src
** Yank
#+begin_src emacs-lisp :tangle suk.el
  ;;; ### Advice ###
  ;;; --- 各种emacs行为建议
  ;; 在特定地模式下粘贴时自动缩进
  (defadvice yank (after indent-region activate)
    "To make yank content indent automatically."
    (if (member major-mode
                '(emacs-lisp-mode
                  java-mode
                  web-mode
                  c-mode
                  c++-mode
                  js-mode
                  latex-mode
                  plain-tex-mode))
        (indent-region (region-beginning) (region-end) nil)))
#+end_src
** Macros
记录一下使用方式

  - =f3= start macro(~kmacro-start-macro-or-insert-counter~),
  - =f4= done macro or run marcro (~kmacro-end-or-call-macro~).
  - =C-x (= start macro (~kmacro-start-macro~),
  - =C-x )= end done marco(~kmacro-end-macro~),
  - =C-x e= ~run marco(kmacro-end-macro)~
  - =C-x C-k r= ~apply-macro-to-region-lines~
  - =C-x C-k C-n= ~kmacro-cycle-ring-next~               ;下一个键盘宏
  - =C-x C-k C-p= ~kmacro-cycle-ring-previous~      ;上一个键盘宏
  - =C-x C-k RET=  ~kmacro-edit-macro~                          ;编辑键盘宏
  - ~insert-kbd-macro~
  - =C-x C-k n=  ~name-last-kbd-macro~ is an alias for ~kmacro-name-last-macro~
  - =C-x C-k C-d=  ~kmacro-delete-ring-head~

  先定义一个宏

  然后 ~name-last-kbd-macro~

  然后 ~insert-kbd-macro~

  等到如下类似的配置
  : (fset 'delete-empty-lines (kbd "M-x flush-lines RET ^\s-*$ RET"))

** Misc packages
#+begin_src emacs-lisp :tangle suk.el
  (run-with-idle-timer
   2 nil
   #'(lambda()
       (use-package paredit) ;; useful for lisp
       (use-package wgrep) ;; eidt the grep / rg result then apply to the origin buffer. Cancel is supportted.
       (use-package writeroom-mode)
       ))

#+end_src

