etc/init-key.el

;; ### String Inflection ###
;; --- 单词语法风格快速转换

 ;;; ### basic-toolkit ###
(lazy-load-global-keys
 '(
   ("M-l" . downcase-char)
   ("M-u" . upcase-char)
   )
 "cases")

;;; ### Thing-edit ###
;;; --- 增强式编辑当前光标的对象 
(lazy-load-global-keys
 '(
   ;; ("C-c w" . thing-copy-word)
   ;; ("C-c s" . thing-copy-symbol)
   ;; ("C-c m" . thing-copy-email)
   ;; ("C-c f" . thing-copy-filename)
   ;; ("C-c u" . thing-copy-url)
   ;; ("C-c x" . thing-copy-sexp)
   ;; ("C-c g" . thing-copy-page)
   ;; ("C-c t" . thing-copy-sentence)
   ;; ("C-c o" . thing-copy-witespace)
   ;; ("C-c i" . thing-copy-list)
   ;; ("C-c c" . thing-copy-comment)
   ;; ("C-c h" . thing-copy-defun)
   ;; ("C-c p" . thing-copy-parentheses)
   ;; ("C-c l" . thing-copy-line)
   ;; ("C-c a" . thing-copy-to-line-begining)
   ;; ("C-c e" . thing-copy-to-line-end)

   ;; ("C-c W" . thing-cut-word)
   ;; ("C-c S" . thing-cut-symbol)
   ;; ("C-c M" . thing-cut-email)
   ;; ("C-c F" . thing-cut-filename)
   ;; ("C-c G" . thing-cut-page)
   ;; ("C-c T" . thing-cut-sentence)
   ;; ("C-c O" . thing-cut-whitespace)
   ;; ("C-c I" . thing-cut-list)
   ;; ("C-c C" . thing-cut-comment)
   ;; ("C-c H" . thing-cut-defun)
   ;; ("C-c P" . thing-cut-parentheses)
   ;; ("C-c L" . thing-cut-line)
   ;; ("C-c A" . thing-cut-to-line-beginning)
   ;; ("C-c E" . thing-cut-to-line-end)
   ("S-SPC e" . hydra-thing-edit/body)
   ("C-c e" . hydra-thing-edit/body)
   )
 "init-thing-edit"
 )

;; ### Buffer Edit ### 
;; --- 缓存编辑
(lazy-load-set-keys
 '(
   ("C-x C-x" . exchange-point-and-mark)   ;交换当前点和标记点
   ("M-o" . backward-delete-char-untabify) ;向前删除字符
   ("C-M-S-h" . mark-paragraph)            ;选中段落
   ("M-SPC" . just-one-space)              ;只有一个空格在光标处
   ))
;;; ### basic-toolkit ###
(lazy-load-global-keys
 '(
   ;;("M-2" . indent-buffer)              ;自动格式化当前Buffer
   ;; indent-comment-buffer
   ;;("C-x u" . mark-line)              ;选中整行
   ("s-k" . kill-and-join-forward)      ;在缩进的行之间删除
   ;;("" . strip-blank-lines)             ; 删除空行
   ;; strip-line-number
   ;; delete-chars-hungry-forward
   ;; delete-chars-hungry-backward
   ;; underline-line-with
   ;; current-line-move-to-top
   ("<f2>" . refresh-file)              ;自动刷新文件
   ("C-S-j" . join-lines)               ;连接下行
   ("M-q" . suk/fill-or-unfill-paragraph)
   ("C-x n N" . suk/xah-narrow-to-region)
   )
 "basic-toolkit")

(lazy-load-global-keys
       '(("M-=" . er/expand-region)
         ("M--" . er/contract-region)
         ("M-S-<Right>" . er/expand-region)
         ("M-S-<Left>" . er/contract-region)
         )
       "expand-region")

(if emacs/>=28p
    (lazy-load-global-keys
     '(("C-x u" . vundo)
       ("C-/" . vundo)
       )
     "vundo")
  (lazy-load-global-keys
   '(("C-x u" . undo-trees)
     ("C-/"   . undo-tree-undo)
     ("C-?  " . undo-tree-redo)
     )
   "undo-tree")
  )

(lazy-load-global-keys
 '(
