etc/init-key.el
   ("C-c b"  . my-hydra-buffers/body)
   ("S-SPC B"  . my-hydra-buffers/body)
   ("M-<f7>" . suk-read-mode)
   ("<f7>"   . olivetti-mode)
   ("C-;"    . suk/close-current-buffer) ;关闭当前buffer
   )
 "buffer-extension")

;; (lazy-load-global-keys
;;  '(
;;     ("<f7>" . olivetti-mode)
;;   )
;;  "olivetti")

;; default keys: C-x LEFT/RIGHT C-, C-.

;; --- 缓存移动
(lazy-load-set-keys
 '(
   ;;("C-z i" . beginning-of-buffer)      ;缓存开始 M-<
   ;;("C-z k" . end-of-buffer)            ;缓存结尾 M->
   ("C-M-f" . forward-paragraph)        ;下一个段落
   ("C-M-b" . backward-paragraph)       ;上一个段落
   ("C-M-y" . backward-up-list)         ;向左跳出 LIST
   ("C-M-o" . up-list)                  ;向右跳出 LIST
   ("C-M-u" . backward-down-list)       ;向左跳进 LIST
   ("C-M-i" . down-list)                ;向右跳进 LIST
   ("C-M-a" . beginning-of-defun)       ;函数开头
   ("C-M-e" . end-of-defun)             ;函数末尾
   ))

(lazy-load-global-keys
 '(
