README.org
*** Buffer autorevert
#+begin_src emacs-lisp :tangle suk.el
  ;; Automatically reload files was modified by external program
  (run-with-idle-timer
   1 nil
   #'(lambda()
       (require-package 'autorevert)
       (use-package autorevert
         :ensure nil
         :diminish
         :defer 2
         :hook (after-init . global-auto-revert-mode))))
#+end_src
*** Auto Save
#+begin_src emacs-lisp :tangle suk.el
  (require 'auto-save)
  (auto-save-enable)
  (setq auto-save-silent t)
  ;;(setq auto-save-delete-trailing-whitespace t)
#+end_src
*** vdiff
#+begin_src emacs-lisp :tangle suk.el
  ;; ### vdiff ###
  (lazy-load-global-keys
   '(
     ("M-s-u" . vdiff-buffers))
   "vdiff")
#+end_src
** 移缓存区之他窗口
#+begin_src emacs-lisp :tangle etc/init-key.el
  (lazy-load-global-keys
   '(
     ("C-c C-<up>"    . buf-move-up)   
     ("C-c C-<down>"  . buf-move-down)
     ("C-c C-<left>"  . buf-move-left)  
     ("C-c C-<right>" . buf-move-right)   
     )
   "buffer-move")
#+end_src
** 快切缓冲区
#+begin_src emacs-lisp :tangle suk.el
  ;; Toggle two most recent buffers
  (fset 'quick-switch-buffer [?\C-x ?b return])
  (global-set-key (kbd "s-b") 'quick-switch-buffer)
  (global-set-key (kbd "C-z b") 'quick-switch-buffer)
#+end_src
* 窗口管理
** 安装插件
#+begin_src emacs-lisp :tangle install.el
  (require-package 'transwin)
  (require-package 'ace-window)
  (require-package 'popper)
#+end_src

** 透明窗口 Transwin
#+begin_src emacs-lisp :tangle suk.el
  ;; Frame transparence
  (lazy-load-global-keys
   '(
     ("C-M-9" . transwin-inc)
     ("C-M-8" . transwin-dec)
     ("C-M-7" . transwin-toggle)
     )
   "transwin"
  )

  (with-eval-after-load 'transwin
    (setq transwin-parameter-alpha 'alpha-background))

#+end_src
** 窗口布局先生 Winner
恢复上一个窗口布局： =C-c <Left>=
回到下一个窗口布局： =C-c <Right>=

#+begin_src emacs-lisp :tangle suk.el
  ;; Restore old window configurations
  (use-package winner
    :ensure nil
    :commands (winner-undo winner-redo) ;; C-c <Left>/C-c <Right>
    :hook (after-init . winner-mode)
    :init (setq winner-boring-buffers '("*Completions*"
                                        "*Compile-Log*"
                                        "*inferior-lisp*"
                                        "*Fuzzy Completions*"
                                        "*Apropos*"
                                        "*Help*"
                                        "*cvs*"
                                        "*Buffer List*"
                                        "*Ibuffer*"
                                        "*esh command on file*"))
    )
#+end_src
** 窗口舞者 Ace-window
#+begin_src emacs-lisp :tangle suk.el
  ;; Quickly switch windows

  (use-package ace-window
    :bind (([remap other-window] . ace-window)
           (:map leader-key ("w" . ace-window-hydra/body)))
    :hook (emacs-startup . ace-window-display-mode)
    :config
    (defun toggle-window-split ()
      (interactive)
      (if (= (count-windows) 2)
          (let* ((this-win-buffer (window-buffer))
                 (next-win-buffer (window-buffer (next-window)))
                 (this-win-edges (window-edges (selected-window)))
                 (next-win-edges (window-edges (next-window)))
                 (this-win-2nd (not (and (<= (car this-win-edges)
                                             (car next-win-edges))
                                         (<= (cadr this-win-edges)
                                             (cadr next-win-edges)))))
                 (splitter
                  (if (= (car this-win-edges)
                         (car (window-edges (next-window))))
                      'split-window-horizontally
                    'split-window-vertically)))
            (delete-other-windows)
            (let ((first-win (selected-window)))
              (funcall splitter)
              (if this-win-2nd (other-window 1))
              (set-window-buffer (selected-window) this-win-buffer)
              (set-window-buffer (next-window) next-win-buffer)
              (select-window first-win)
              (if this-win-2nd (other-window 1))))
        (user-error "`toggle-window-split' only supports two windows")))

    ;; Bind hydra to dispatch list
    (add-to-list 'aw-dispatch-alist '(?w ace-window-hydra/body) t)

    ;; Select widnow via `M-1'...`M-9'
    (defun aw--select-window (number)
      "Slecet the specified window."
      (when (numberp number)
        (let ((found nil))
          (dolist (win (aw-window-list))
            (when (and (window-live-p win)
                       (eq number
                           (string-to-number
                            (window-parameter win 'ace-window-path))))
              (setq found t)
              (aw-switch-to-window win)))
          (unless found
            (message "No specified window: %d" number)))))
    (dotimes (n 9)
      (bind-key (format "M-%d" (1+ n))
                (lambda ()
                  (interactive)
                  (aw--select-window (1+ n))))))

#+end_src
** Enforce rules for popups
#+begin_src emacs-lisp :tangle suk.el
  ;; Enforce rules for popups
  (use-package popper
    :custom
    (popper-group-function #'popper-group-by-directory)
    (popper-echo-dispatch-actions t)
    :bind (:map popper-mode-map
                ("C-h z"       . popper-toggle)
                ("C-<tab>"     . popper-cycle)
                ("C-M-<tab>"   . popper-toggle-type))
    :hook (emacs-startup . popper-echo-mode)
    :init
    (setq popper-reference-buffers
          '("\\*Messages\\*$"
            "Output\\*$" "\\*Pp Eval Output\\*$"
            "^\\*eldoc.*\\*$"
            "\\*Compile-Log\\*$"
            "\\*Completions\\*$"
            "\\*Warnings\\*$"
            "\\*Async Shell Command\\*$"
            "\\*Apropos\\*$"
            "\\*Backtrace\\*$"
            "\\*Calendar\\*$"
            "\\*Fd\\*$" "\\*Find\\*$" "\\*Finder\\*$"
            "\\*Kill Ring\\*$"
            "\\*Embark \\(Collect\\|Live\\):.*\\*$"

            bookmark-bmenu-mode
            comint-mode
            compilation-mode
            help-mode helpful-mode
            tabulated-list-mode
            Buffer-menu-mode

            flymake-diagnostics-buffer-mode
            flycheck-error-list-mode flycheck-verify-mode

            gnus-article-mode devdocs-mode
            grep-mode occur-mode rg-mode deadgrep-mode ag-mode pt-mode
            youdao-dictionary-mode osx-dictionary-mode fanyi-mode

            "^\\*Process List\\*$" process-menu-mode
            list-environment-mode cargo-process-mode

            "^\\*.*eshell.*\\*.*$"
            "^\\*.*shell.*\\*.*$"
            "^\\*.*terminal.*\\*.*$"
            "^\\*.*vterm[inal]*.*\\*.*$"

            "\\*DAP Templates\\*$" dap-server-log-mode
            "\\*ELP Profiling Restuls\\*" profiler-report-mode
            "\\*Paradox Report\\*$" "\\*package update results\\*$" "\\*Package-Lint\\*$"
            "\\*[Wo]*Man.*\\*$"
            "\\*ert\\*$" overseer-buffer-mode
            "\\*gud-debug\\*$"
            "\\*lsp-help\\*$" "\\*lsp session\\*$"
            "\\*quickrun\\*$"
            "\\*tldr\\*$"
            "\\*vc-.*\\**"
            "\\*diff-hl\\**"
            "^\\*macro expansion\\**"

            "\\*Agenda Commands\\*" "\\*Org Select\\*" "\\*Capture\\*" "^CAPTURE-.*\\.org*"
            "\\*Gofmt Errors\\*$" "\\*Go Test\\*$" godoc-mode
            "\\*docker-.+\\*"
            "\\*prolog\\*" inferior-python-mode
            "\\*rustfmt\\*$" rustic-compilation-mode rustic-cargo-clippy-mode
            rustic-cargo-outdated-mode rustic-cargo-run-mode rustic-cargo-test-mode
            ))

    (with-eval-after-load 'doom-modeline
      (setq popper-mode-line
            '(:eval (let ((face (if (doom-modeline--active)
                                    'doom-modeline-emphasis
                                  'doom-modeline)))
                      (if (and (icons-displayable-p)
                               (bound-and-true-p doom-modeline-icon)
                               (bound-and-true-p doom-modeline-mode))
                          (format " %s "
                                  (nerd-icons-octicon "nf-oct-pin" :face face))
                        (propertize " POP " 'face face))))))
    :config
    (with-no-warnings
      (defun my-popper-fit-window-height (win)
        "Determine the height of popup window WIN by fitting it to the buffer's content."
        (fit-window-to-buffer
         win
         (floor (frame-height) 3)
         (floor (frame-height) 3)))
      (setq popper-window-height #'my-popper-fit-window-height)

      (defun popper-close-window-hack (&rest _)
        "Close popper window via `C-g'."
        ;; `C-g' can deactivate region
        (when (and (called-interactively-p 'interactive)
                   (not (region-active-p))
                   popper-open-popup-alist)
          (let ((window (caar popper-open-popup-alist)))
            (when (window-live-p window)
              (delete-window window)))))
      (advice-add #'keyboard-quit :before #'popper-close-window-hack)))


#+end_src
** Menu
#+begin_src emacs-lisp :tangle suk.el
  (suk/wait-for-modules
   (lambda()
     (with-eval-after-load 'pretty-hydra
       (pretty-hydra-define+ ace-window-hydra
         (:title (pretty-hydra-title "Window Management" 'faicon "nf-fa-th")
                 :foreign-keys warn
                 :quit-key ("q" "C-g"))
         ("Actions"
          (;;("TAB" other-window "switch")
           ("x" ace-delete-window "delete")
           ("X" ace-delete-other-windows "delete other" :exit t)
           ("s" ace-swap-window "swap")
           ("a" ace-select-window "select" :exit t)
           ("m" toggle-frame-maximized "maximize" :exit t)
           ("u" toggle-frame-fullscreen "fullscreen" :exit t))
          "Resize"
          (("<left>" shrink-window-horizontally "shrink H")
           ("<right>" enlarge-window-horizontally "enlarge H")
           ("<up>" shrink-window "shrink V")
           ("<down>" enlarge-window "enlarge V")
           ("n" balance-windows "balance"))
          "Split"
          (("r" split-window-right "horizontally")
           ("R" split-window-horizontally-instead "horizontally instead")
           ("v" split-window-below "vertically")
           ("V" split-window-vertically-instead "vertically instead")
           ("t" toggle-window-split "toggle")
           ("o" delete-other-windows "only this"))
          "Zoom"
          (("+" text-scale-increase "in")
           ("=" text-scale-increase "in")
           ("-" text-scale-decrease "out")
           ("0" (text-scale-increase 0) "reset"))
          "Misc"
          (("o" set-frame-font "frame font")
           ("f" make-frame-command "new frame")
           ("d" delete-frame "delete frame")
           ("z" winner-undo "winner undo")
           ("Z" winner-redo "winner redo"))
          )
         )
       (bind-key "w" #'ace-window-hydra/body leader-key)
       ))
   'ace-window
   'winner
   )
#+end_src
** 快捷键
#+begin_src emacs-lisp :tangle suk.el

  (lazy-load-global-keys
   '(
     ("C-c V" . delete-other-windows-vertically+)   ;关闭上下的其他窗口
     ("C-c H" . delete-other-windows-horizontally+) ;关闭左右的其他窗口
     ("C-'"   . delete-current-buffer-and-window)   ;关闭当前buffer, 并关闭窗口
     ("C-\""  . delete-current-buffer-window)       ;删除当前buffer的窗口
     ("M-s-o" . toggle-one-window)                  ;切换一个窗口
     ("C-x O" . toggle-window-split)
     )
   "window-extension")
#+end_src
* 书签 Bookmark
#+begin_src emacs-lisp :tangle suk.el

  (lazy-load-local-keys
   '(
     ("b" . suk/bookmark-launcher/body)
     )
   leader-key
   "my-bookmark"
   ) ;; 有的函数跟basic-toolkit重复

  ;; C-x r l to list bookmarks
#+end_src

* 搜索

** Setup
#+begin_src emacs-lisp :tangle etc/init-search.el
  (provide 'init-search)
#+end_src
Add to suk.el
#+begin_src emacs-lisp :tangle suk.el
  (require 'init-search)
#+end_src
** Search tools
*** 安装插件
#+begin_src emacs-lisp :tangle install.el
  ;;在 Windows 上，如果你用 Emacs GUI 版本，默认有时会找不到 PATH 中的程序，
  ;;可以在 Emacs 配置里手动添加环境变量，或者使用
  ;; exec-path-from-shell 等包（但这个包通常在 macOS/Linux下更常用；
  ;;Windows 下可能需要手工设置 exec-path）。
  (require-package 'exec-path-from-shell)
  ;; (setq exec-path (append exec-path '("C:/path/to/python" "C:/path/to/node")))
  ;; (setenv "PATH" (concat (getenv "PATH") ";C:\\path\\to\\python;C:\\path\\to\\node"))




  ;; (require-package 'counsel) ; counsel => swiper => ivy
  ;; (require-package 'counsel-bbdb)
  ;; (require-package 'counsel-gtags)
  ;; (require-package 'counsel-css)
  (require-package 'bbdb)

  (require-package 'ivy)
  (require-package 'ivy-posframe)
  (require-package 'find-file-in-project)
  (require-package 'swiper)

  (require-package 'pinyinlib)
  (require-package 'ace-pinyin)
  (require-package 'goto-chg)
  (require-package 'avy)
  (require-package 'avy-zap)

#+end_src
*** ivy
#+begin_src emacs-lisp :tangle etc/init-search.el
  (use-package ivy
   :ensure t
   :diminish (ivy-mode)
   :config
   (ivy-mode 1)
   (setq ivy-use-virtual-buffers t)
   (setq enable-recursive-minibuffers t)
   (setq ivy-count-format "%d/%d ")
   (setq ivy-display-style 'fancy)

   (define-key ivy-minibuffer-map [escape] 'minibuffer-keyboard-quit)
 
   (when (display-graphic-p)    
     (use-package ivy-posframe))
   )
#+end_src
*** counsel
#+begin_src emacs-lisp :tangle etc/init-search.el
  (use-package counsel
    :after ivy
    :ensure t
    :bind
    (
     ;; ("M-y" . counsel-yank-pop)
     ;; ("C-x C-f" . counsel-find-file)
     ("M-x" . counsel-M-x)
    )
  )
#+end_src
