etc/init-key.el
   ("C-c C-<up>"    . buf-move-up)   
   ("C-c C-<down>"  . buf-move-down)
   ("C-c C-<left>"  . buf-move-left)  
   ("C-c C-<right>" . buf-move-right)   
   )
 "buffer-move")

;;; --- 笔记管理和组织
