etc/init-search.el
(provide 'init-search)

(use-package ivy
 :ensure t
 :diminish (ivy-mode)
 :config
 (ivy-mode 1)
 (setq ivy-use-virtual-buffers t)
 (setq enable-recursive-minibuffers t)
 (setq ivy-count-format "%d/%d ")
 (setq ivy-display-style 'fancy)

 (define-key ivy-minibuffer-map [escape] 'minibuffer-keyboard-quit)

 (when (display-graphic-p)    
   (use-package ivy-posframe))
 )

(use-package counsel
  :after ivy
  :ensure t
  :bind
  (
   ;; ("M-y" . counsel-yank-pop)
   ;; ("C-x C-f" . counsel-find-file)
   ("M-x" . counsel-M-x)
  )
)
