README.org
*** swiper
#+begin_src emacs-lisp :tangle etc/init-search.el

  (use-package swiper
    :bind
    (
     ("C-x M-s" . swiper)
     ("C-s"     . swiper-isearch)
     ("C-r"     . swiper-isearch)
     ("C-c C-r" . ivy-resume)
     )
    :config
    (progn
      ;;(ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      ;;(setq ivy-display-style 'fancy)
      (define-key read-expression-map (kbd "C-r") 'counsel-expression-history))
    )


#+end_src
*** avy
#+begin_src emacs-lisp :tangle etc/init-search.el
  (lazy-load-global-keys
   '(("C-:"   . avy-goto-char)
      ("C-M-;" . avy-goto-char-2)
      ("M-g l" . avy-goto-line)
      ("M-g w" . avy-goto-word-1)
      ("M-g W" . avy-goto-word-0))
   "avy"
   )

  (with-eval-after-load 'avy
    (setq avy-all-windows nil
          avy-all-windows-alt t
          avy-background t
          avy-style 'pre)
    (add-hook 'after-init-hook #'avy-setup-default)
    )

  (with-eval-after-load 'avy-zap
    ;; Kill text between the point and the character CHAR
    (lazy-load-global-keys
     '(("M-z" . avy-zap-to-char-dwim)
       ("M-Z" . avy-zap-up-to-char-dwim))
     "avy-zap"
     "C-z")
    )


#+end_src
** Grep
#+begin_src emacs-lisp :tangle etc/init-tools.el
  
  ;; Writable `grep' buffer
  (use-package wgrep
    :init
    (setq wgrep-auto-save-buffer t
          wgrep-change-readonly-file t))

  ;; Search tool
  (use-package grep
    :ensure nil
    :autoload grep-apply-setting
    :init
    (when (executable-find "rg")
      (grep-apply-setting
       'grep-command "rg --color=auto --null -nH --no-heading -e ")
      (grep-apply-setting
       'grep-template "rg --color=auto --null --no-heading -g '!*/' -e <R> <D>")
      (grep-apply-setting
       'grep-find-command '("rg --color=auto --null -nH --no-heading -e ''" . 38))
      (grep-apply-setting
       'grep-find-template "rg --color=auto --null -nH --no-heading -e <R> <D>")))


  ;; Fast search tool `ripgrep'
  (use-package rg
    :hook (after-init . rg-enable-default-bindings)
    :bind (:map rg-global-map
                ("c" . rg-dwim-current-dir)
                ("f" . rg-dwim-current-file)
                ("m" . rg-menu))
    :init (setq rg-group-result t
                rg-show-columns t)
    :config
    (cl-pushnew '("tmpl" . "*.tmpl") rg-custom-type-aliases))

#+end_src
** 星际译王命令行
#+begin_src emacs-lisp :tangle achrives-and-examples.el
  ;;; ### Sdcv ###
  ;;; --- 星际译王命令行
  (when  (eq system-type 'gnu/linux)
      (lazy-load-global-keys
       '(("p" . sdcv-search-pointer)           ;光标处的单词, buffer显示
         ("P" . sdcv-search-pointer+)          ;光标处的单词, tooltip显示
         ("i" . sdcv-search-input)             ;输入的单词, buffer显示
         (";" . sdcv-search-input+)
         ("y" . my-youdao-dictionary-search-at-point)
         ("Y" . youdao-dictionary-search-at-point)
         ("g" . google-translate-at-point)
         ("G" . google-translate-query-translate)
         ("s" . google-translate-smooth-translate)
         ("f" . fanyi-dwim)
         ("d" . fanyi-dwim2)
         ("h" . fanyi-from-history)
         )
       "init-translate"
       "C-z"))
#+end_src
* Org
** Setup
#+begin_src emacs-lisp :tangle etc/init-org.el
  (provide 'init-org)
#+end_src
Add to suk.el
#+begin_src emacs-lisp :tangle suk.el
  (require 'init-org)
#+end_src

** Base settings
#+begin_src emacs-lisp :tangle etc/init-org.el
  ;;(message org-files-directory)
  ;; 创建 var 文件夹
  (make-directory (expand-file-name "var" user-emacs-directory) t)

  ;; 设置 org-persist 目录
  (setq org-persist-directory (expand-file-name "var/org-persist" user-emacs-directory))
  ;; 创建新的 org-persist 目录（如果不存在）
  (unless (file-exists-p org-persist-directory)
    (make-directory org-persist-directory t))
  (require 'org)
  ;; To speed up startup, don't put to init section
  (setq org-modules nil)
  ;;(setq org-startup-indented t)
  (setq org-startup-folded nil)
  (setq org-ellipsis  "... → ")
  (setq org-pretty-entities t)
  (setq org-hide-emphasis-markers t)
  (setq org-hide-leading-stars nil)
  (setq org-blank-before-new-entry '((heading) (plain-list-item . auto)))
  (setq org-insert-heading-respect-content t)
  (setq org-yank-adjusted-subtrees t)
  ;; Use the current window for C-c ' source editing
  (setq org-src-window-setup 'current-window)
  ;; Use the current window for indirect buffer display
  (setq org-indirect-buffer-display 'current-window)
  (add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\)$" . org-mode))

  (setq org-tags-column -80)

  (setq org-catch-invisible-edits 'smart)

  ;; 设置打开某种文件类型
  (setq org-file-apps
        '((auto-mode . emacs)
          ("\\.mm\\'" . system)
          ("\\.x?html?\\'" . system)
          ("\\.pdf\\'" . system)))

    ;; 运行 Org Babel Tangle 命令：`M-x org-babel-tangle`。
    ;; 从 org 文件中生成 el 配置文件
    ;; 保存 user-emacs-directory(~/.emacs.d/) 文件下的 org 时，
    ;; 导出文件中 elisp 代码到文件中。
    (defun suk/org-babel-tangle-config ()
      (when (string-equal (file-name-directory (buffer-file-name))
                          (expand-file-name user-emacs-directory)) ; ~/.emacs.d
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle))))

    (add-hook 'org-mode-hook
              (lambda ()
                (add-hook 'after-save-hook #'suk/org-babel-tangle-config)))


    ;;;###autoload
    (defun suk/load-theme-org()
      (interactive)
      (load-theme 'doom-solarized-light)
      )

    ;;;###autoload
    (defun suk/load-theme-default()
      (interactive)
      (load-theme 'doom-one)
      )
#+end_src
