README.org
** GTD
#+begin_src emacs-lisp :tangle etc/init-org.el
  ;; GTD
  (setq org-use-fast-todo-selection t)
  ;; ! 的含义是记录某项更改为状态的时间。我不把这个添加到完成的状态，是因为它们已
  ;; 经被记录了。

  ;; @ 符号表示带理由的提示，所以当切换到 WAITTING 时，Org 模式会问我为什么，并将
  ;; 这个添加到笔记中。
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n!)"  "|" "DONE(d!)" "CANCELLED(c@/!)")
          (sequence "WAIT(w@/!)" "HOLD(h@/!)" "|" "ABORT" "SOME" "PHONE" "MEETING")))
  (setq org-todo-keyword-faces
        '(("TODO" :foreground "red" :weight bold)
          ("NEXT" :foreground "blue" :weight bold)
          ("DONE" :foreground "forest green" :weight bold)
          ("WAIT" :foreground "orange" :weight bold)
          ("HOLD" :foreground "magenta" :weight bold)
          ;;("CANCELLED" :foreground "forest grey" :weight bold)
          ("ABORT" :foreground "yellow" :weight bold)
          ("SOME" :foreground "lightgreen" :weight bold)
          ("MEETING" :foreground "lightblue" :weight bold)
          ("PHONE" :foreground "pink" :weight bold) ))


  (setq org-priority-faces
        '((?A . error)
          (?B . warning)
          (?C . success)))

  (setq org-tag-alist '((:startgroup . nil)
                      ("Levle1" . ?u)     ;; 第一象限：紧急且重要
                      ("Level2" . ?n)     ;; 第二象限：不紧急但重要
                      ("Level3" . ?i)     ;; 第三象限：紧急但不重要
                      ("Level4" . ?t)     ;; 第四象限：不紧急且不重要
                      (:endgroup . nil)))

  ;; 可以使用 org-tags-view 来过滤和查看不同象限的任务
  ;; 例如：M-x org-tags-view RET +urgent-important
  ;; The triggers break down to the following rules:
  ;;   Moving a task to CANCELLED adds a CANCELLED tag
  ;;   Moving a task to WAITTING adds a WAITTING tag
  ;;   Moving a task to HOLD adds WAITTING and HOLD tags
  ;;   Moving a task to a done state removes WAITTING and HOLD tags
  ;;   Moving a task to TODO removes WAITTING, CANCELLED, and HOLD tags
  ;;   Moving a task to NEXT removes WAITTING, CANCELLED, and HOLD tags
  ;;   Moving a task to DONE removes WAITTING, CANCELLED, and HOLD tags
  (setq org-todo-state-tags-triggers
        '(("CANCELLED" ("CANCELLED" . t))
          ("WAIT" ("WAITTING" . t))
          ("HOLD" ("WAITTING") ("HOLD" . t))
          (done ("WAITING") ("HOLD"))
          ("DONE" ("WAITTING") ("CANCELLED") ("HOLD"))
          ("ABORT" ("WAITTING") ("CANCELLED") ("HOLD"))
          ("TODO" ("WAITTING") ("CANCELLED") ("HOLD"))
          ("NEXT" ("WAITTING") ("CANCELLED") ("HOLD"))
          ("SOME" ("WAITTING") ("CANCELLED") ("HOLD"))))
  (setq org-log-done 'time)

  ;; Start the weekly agenda on Monday
  (setq org-agenda-start-on-weekday 1)
  (setq org-agenda-diary-file (expand-file-name "diary.org" org-files-directory))
  (setq org-agenda-block-separator ?─)
  (setq org-agenda-time-grid
        '((daily today require-timed)
          (800 1000 1200 1400 1600 1800 2000)
          " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄"))
  (setq org-agenda-current-time-string
        "⭠ now ─────────────────────────────────────────────────")
  (setq org-agenda-diary-file (expand-file-name "diary.org" org-files-directory))
  ;; setup agenda files
  ;; org-mode manages the org-agenda-files variable automatically
  ;; using C-c [ and C-c ] to add and remove files respectively.
  ;; They can be files or directories.
  (setq org-agenda-files
        `(,(expand-file-name "gtd.org" org-files-directory)
          ,(expand-file-name "work.org" org-files-directory)
          ,(expand-file-name "finished.org" org-files-directory)
          ,(expand-file-name "cancel.org" org-files-directory)
          ,(expand-file-name "journal.org" org-files-directory)
          ,(expand-file-name "trash.org" org-files-directory)
          ;;,(expand-file-name "folder" org-files-directory)
          ))

#+end_src


** Archive
  - C-c C-x C-a (org-archive-subtree)：最常用的归档命令，将当前子树移动到指定归档文件/节点。
  - C-c C-x a (org-toggle-archive-tag)：给当前条目添加/移除 ARCHIVE 标签，就地归档而不移动位置。
  - C-c C-x A (org-archive-to-archive-sibling)：在同一层级创建“归档兄弟节点”。
    
  根据自己的工作流和对“归档”的理解（是要移动还是仅仅隐藏）来选择合适的
  命令。如果你想真正把完成/历史条目“挪走”，多用 C-c C-x C-a；如果只是
  想让它们保持在原处却不再显示，则可以用 C-c C-x a。另外，也别忘了通过
  org-archive-location 配置好归档文件或归档标题，以便管理归档内容更加
  顺畅。
#+begin_src emacs-elisp :tangle etc/init-org.el
  ;; default is "%s_archive::", I want to archive in a sginle file.
  ;; use C-u C-c C-x C-a to change
  (setq org-archive-location "archive.org::* Archived Tasks")
#+end_src

** Capture
#+begin_src emacs-lisp :tangle etc/init-org.el
  ;; capture template
  (setq org-default-notes-file (expand-file-name "notes.org" org-files-directory))
  ;; Capture templates for: TODO tasks, Notes,
  ;; appointments, phone calls, meetings, and (setq
  ;; org-protocol)
  (setq org-capture-templates
        '(
          ("t" "Todo"
           entry (file+headline (expand-file-name "gtd.org" org-files-directory) "Tasks")
           "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
          ("n" "Note"
           entry (file (expand-file-name "notes.org" org-files-directory))
           "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
          ("r" "Respond"
           entry (file (expand-file-name "gtd.org" org-files-directory))
           "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n"
           :clock-in t :clock-resume t :immediate-finish t)
          ("j" "Journal"
           entry (file+datetree (expand-file-name "journal.org" org-files-directory))
           "* %?\nEntered on %U\n  %i\n  %a" :clock-in t :clock-resume t)
          ("w" "Review"
           entry (file (expand-file-name "gtd.org" org-files-directory))
           "* TODO Review %c\n%U\n"
           :immediate-finish t)
          ("m" "Meeting"
           entry (file (expand-file-name "gtd.org" org-files-directory))
           "* MEETING with %? :MEETING:\n%U"
           :clock-in t :clock-resume t)
          ("p" "Phone call"
           entry (file (expand-file-name "gtd.org" org-files-directory))
           "* PHONE %? :PHONE:\n%U"
           :clock-in t :clock-resume t)
          ("h" "Habit"
           entry (file (expand-file-name "gtd.org" org-files-directory))
           "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n")
          ))
#+end_src
** Refile
#+begin_src emacs-lisp :tangle etc/init-org.el
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Refile settings
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Exclude DONE state tasks from refile targets
      ;;;###autoload
  (defun suk/verify-refile-target ()
    "Exclude todo keywords with a done state from refile targets."
    (not (member (nth 2 (org-heading-components)) org-done-keywords)))

  ;; Targets include this file and any file contributing to the agenda - up to 9 levels deep
  (setq org-refile-targets (quote ((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9))))
  ;; Use full outline paths for refile targets
  (setq org-refile-use-outline-path t)
  (setq org-refile-target-verify-function 'suk/verify-refile-target)
  ;; Allow refile to create parent tasks with confirmation
  (setq org-refile-allow-creating-parent-nodes 'confirm)

#+end_src

