etc/init-org.el

;; Registers allow you to jump to a file or other location quickly.
;; To jump to a register, use C-x r j followed by the letter of the register.
;; Using registers for all these file shortcuts is probably a bit of
;; a waste since I can easily define my own keymap, but since I rarely
;; go beyond register A anyway. Also, I might as well add shortcuts for refiling.
(require 'bookmark)
(defvar my-refile-map (make-sparse-keymap))
(defmacro my-defshortcut (key file)
`(progn
   (set-register ,key (cons 'file ,file))
   (bookmark-store ,file (list (cons 'filename ,file)
                               (cons 'position 1)
                               (cons 'front-context-string "")) nil)
   (define-key my-refile-map
               (char-to-string ,key)
               (lambda (prefix)
                 "Call org-refile to target: FILE"
                 (interactive "p")
                 (let ((org-refile-targets (list (cons (list ,file) '(:maxlevel . 3))))
                       (current-prefix-arg (or current-prefix-arg '(4))))
                   (call-interactively 'org-refile))))))

(defvar my-org-last-refile-marker nil "Marker for last refile")
(defun my-org-refile-in-file (&optional prefix)
  "Refile to a target within the current file."
  (interactive)
  (let ((org-refile-targets (list (cons (list (buffer-file-name)) '(:maxlevel . 5)))))
    (call-interactively 'org-refile)
    (setq my-org-last-refile-marker (plist-get org-bookmark-names-plist :last-refile))))

(defun my-org-refile-to-previous ()
  "Refile subtree to last position from `my-org-refile-in-file'."
  (interactive)
  (save-selected-window
    (when (eq major-mode 'org-agenda-mode)
      (org-agenda-switch-to))
    (org-cut-subtree)
    (save-window-excursion
      (save-excursion
        (bookmark-jump (plist-get org-bookmark-names-plist :last-refile))
        (let ((level (org-current-level)))
          (org-end-of-subtree t t)
          (org-paste-subtree))))))



(define-key my-refile-map "," 'my-org-refile-to-previous)
(define-key my-refile-map "." 'my-org-refile-in-file)
(my-defshortcut ?e "~/.emacs.d/README.org")
(my-defshortcut ?g (expand-file-name "gtd.org" org-files-directory))
(my-defshortcut ?w (expand-file-name "work.org" org-files-directory))
(my-defshortcut ?f (expand-file-name "finished.org" org-files-directory))
(my-defshortcut ?c (expand-file-name "cancel.org" org-files-directory))
(my-defshortcut ?t (expand-file-name "trash.org" org-files-directory))
(my-defshortcut ?n (expand-file-name "notes.org" org-files-directory))
(my-defshortcut ?j (expand-file-name "journal.org" org-files-directory))
(my-defshortcut ?N "~/notes")
;; 额外定义的位置
(load-if-exists (expand-file-name "my-defshortcuts.el" suk-emacs-config-dir))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; EXPORTER
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
