README.org
** Use org-modern
#+begin_src emacs-lisp :tangle etc/init-org.el
  ;;Prettify UI
  (use-package org-modern
    :custom
    ;;  (org-modern-table nil)
    (prettify-symbols-alist nil)
    :config
    ;; Disable Prettify Symbols mode globally or locally as needed
    ;;(global-prettify-symbols-mode -1)
    :hook ((org-mode . org-modern-mode)
           (org-agenda-finalize . org-modern-agenda)
           ))
  
#+end_src
** Use org-roam
#+begin_src emacs-lisp :tangle etc/init-org.el
  (use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t)
    (setq org-roam-db-location "~/.emacs.d/var/org-roam.db")
    :custom
    ;; (org-roam-directory (file-truename "~/RoadNotes"))
    ;; The file-truename function is only necessary when you use
    ;; symbolic links inside org-roam-directory: Org-roam does not
    ;; resolve symbolic links.
    (make-directory (expand-file-name "daily" org-roam-directory) t)
    (org-roam-completion-everywhere t)
    (org-roam-dailies-capture-templates
     '(("d" "default" entry "* %<%I:%M %p>: %?"
        :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           :map org-mode-map
           ("C-M-i" . completion-at-point)
           :map org-roam-dailies-map
           ("Y" . org-roam-dailies-capture-yesterday)
           ("n" . org-roam-dailies-capture-today)
           ("T" . org-roam-dailies-capture-tomorrow)
           ("v" . org-roam-dailies-capture-date)
           ("d" . org-roam-dailies-goto-today)
           ("t" . org-roam-dailies-goto-tomorrow)
           ("y" . org-roam-dailies-goto-yesterday)
           ("c" . org-roam-dailies-goto-date)
           ("b" . org-roam-dailies-goto-next-note)
           ("f" . org-roam-dailies-goto-previous-note)
           )
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies) ;; Ensure the keymap is available
    (org-roam-db-autosync-mode)

    )
#+end_src
** Add shortcuts
#+begin_src emacs-lisp :tangle etc/init-key.el
  ;;; --- 笔记管理和组织
  (define-prefix-command 'F9-map)
  (global-set-key (kbd "<f9>") 'F9-map)
  (lazy-load-set-keys
   '(("a" . org-agenda)
     ("A" . org-attach)
     ("s" . show-org-agenda)
     ("c" . org-capture)
     ("i" . org-toggle-inline-images)
     ("l" . org-toggle-link-display)
     ("d" . calendar)
     ("r" . my-refile-map)
     ("h" . hydra-global-org/body)
     )
  nil
   "<f9>")
    (define-prefix-command 'my-refile-map)
    (global-set-key (kbd "C-c r") 'my-refile-map)
    ;; I use C-c c to start capture mode
    (global-set-key (kbd "C-c c") #'org-capture)
    ;; ;; (global-set-key (kbd "C-c C") 'org-capture)
    (global-set-key "\C-cl" #'org-store-link)
    (global-set-key "\C-ca" #'org-agenda)
    ;;(global-set-key "\C-cb" #'org-iswitchb)

    ;; C-',  C-, is org-cycle-agenda-files keys
    ;; 新版的org-mode使用C-c C-, 替换了 <sTAB 提供的模板功能。

#+end_src

* Recentf
#+begin_src emacs-lisp :tangle suk.el
  ;; Recentf
  (setq recentf-save-file (concat suk-emacs-var-dir "/recentf"))
  ;;(setq recentf-save-file "~/.emacs.d/var/recentf")
  (use-package recentf
    :ensure nil
    :defer 1
    :init
    (setq recentf-save-file (concat suk-emacs-var-dir "/recentf"))
    ;;(setq recentf-save-file "~/.emacs.d/var/recentf")
    ;;(add-hook 'after-init-hook #'recentf-mode)
    (setq recentf-max-saved-items 500)
    (setq recentf-max-saved-items 17)
    (recentf-mode)
    (recentf-track-opened-file)

    :config
    (add-to-list 'recentf-exclude (expand-file-name package-user-dir))
    (add-to-list 'recentf-exclude ".cache")
    (add-to-list 'recentf-exclude ".cask")
    (add-to-list 'recentf-exclude ".elfeed")
    (add-to-list 'recentf-exclude "bookmarks")
    (add-to-list 'recentf-exclude "cache")
    (add-to-list 'recentf-exclude "persp-confs")
    (add-to-list 'recentf-exclude "recentf")
    (add-to-list 'recentf-exclude "url")
    (add-to-list 'recentf-exclude "COMMIT_EDITMSG\\'")
    (defun suk/recentf-exclude-p (file)
      (let ((file-dir (file-truename (file-name-directory file))))
        (-any-p (lamdba (dir)
                        (string-prefix-p dir file-dir))
                (mapcar 'file-truename (list var package-user-dir)))))
    (add-to-list 'recentf-exclude #'suk/recentf-exclude-p)
    )

#+end_src
* Session
加载保存的事务。
#+begin_src emacs-lisp :tangle suk.el
  (use-package session)
  (require 'auto-save)
  ;; todo dont load
  (require 'basic-toolkit)

  (setq desktop-load-locked-desktop t) ; don't popup dialog ask user, load anyway
  (setq desktop-restore-frames nil)    ; don't restore any frame

  (defun emacs-session-restore ()
    "Restore emacs session."
    (interactive)
    (ignore-errors
      ;; Kill other windows.
      (delete-other-windows)
      ;; Kill unused buffers.
      (kill-unused-buffers)
      ;; Restore session.
      (desktop-read "~/.emacs.d/var/")
      ))

  (defun emacs-session-save (&optional arg)
    "Save emacs session."
    (interactive "p")
    (ignore-errors
      (if (equal arg 4)
          ;; Kill all buffers if with prefix argument.
          (mapc 'kill-buffer (buffer-list))
        ;; Kill unused buffers.
        (kill-unused-buffers)
        ;; Save all buffers before exit.
        (auto-save-buffers))
      ;; Save session.
      (make-directory "~/.emacs.d/var/" t)
      (desktop-save "~/.emacs.d/var/")
      ;; Exit emacs.
      (kill-emacs)))

  (global-set-key (kbd "S-<f9>") 'emacs-session-save)
  (global-set-key (kbd "C-<f9>") 'emacs-session-save)

  (emacs-session-restore)
#+end_src
* Completion
** install
#+begin_src emacs-lisp :tangle install.el
  (require-package 'company)
  (require-package 'company-box)
#+end_src
** setup
#+begin_src emacs-lisp :tangle etc/init-completion.el
  (provide 'init-completion)
#+end_src
Add to suk.el
#+begin_src emacs-lisp :tangle suk.el
  (require 'init-completion)
#+end_src
** Vertico
:PROPERTIES:
:CUSTOM_ID: setup-vertico
:END:
<<setup-vertico>>

Vertico 是 Emacs 中的一款用于增强 minibuffer 输入体验的插件，特别是在
逐步改进 completion（自动补全）和选择候选项时的界面表现。

主要特点

   + 垂直选择界面：

       Vertico 提供了一种垂直的候选项显示方式，与默认的 minibuffer 不
     同，它通过在屏幕上垂直列出候选项，并允许你快速浏览、选择候选项。
     它不仅仅是补全，还是一个直观的选择界面。

   * 快速和轻量：

      它的设计理念是简单、轻量并且快速。它不会像其他一些补全框架那样带
     有过多复杂的功能，而是专注于提供流畅的、响应迅速的候选项显示。

   * 兼容性强：

      Vertico 是与 completion 和 minibuffer 的默认系统紧密集成的，并且
     它支持与其他补全框架如 company-mode 和 corfu 一起使用，帮助你在选
     择候选项时提供更好的体验。

   * 适配性：

     它能够与很多流行的插件（如 Consult, Orderless, Embark）无缝配合，
     扩展候选项选择的功能。
        
#+begin_src emacs-lisp :tangle etc/init-completion.el
  (when (display-graphic-p)
    (use-package vertico
      :bind (:map vertico-map
                  ("RET"   . vertico-directory-enter)
                  ("DEL"   . vertico-directory-delete-char)
                  ("M-DEL" . vertico-directory-delete-word))
      :hook ((after-init . vertico-mode)
             (rfn-eshadow-update-overlay . vertico-directory-tidy))
      )
     (use-package vertico-posframe
        :ensure t
        :after (posframe vertico)
        :hook (vertico-mode . vertico-posframe-mode)
        :init (setq vertico-posframe-parameters '((left-fringe  . 8) (right-fringe . 8)))
        )
    )
#+end_src
** corfu
#+begin_src emacs-lisp :tangle etc/init-completion.el
  (use-package corfu
    :custom
    (corfu-cycle t)
    (corfu-auto t)
    (corfu-auto-prefix 2)
    (corfu-auto-delay 1)
    (corfu-popupinfo-delay '(0.5 . 0.2))
    (corfu-preview-current 'insert)
    (corfu-preselect 'prompt)
    (corfu-on-exeact-match nil)
    :bind (:map corfu-map
                ("TAB" . corfu-next)
                ([tab] . corfu-next)
                ("C-n" . corfu-next)
                ("S-TAB" . corfu-previous)
                ([backtab] . corfu-previous)
                ("C-p" . corfu-previous)
                ("S-<return>" . corfu-insert)
                ("RET" . nil)
                ("<return>" . corfu-mode)
                ("C-y" . corfu-yank)
                ("C-g" . corfu-abort))
    :init
    (global-corfu-mode)
    (corfu-history-mode))

  (use-package nerd-icons-corfu
    :after corfu
    :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

#+end_src
** Company
*** Setup
#+begin_src emacs-lisp :tangle etc/init-completion-company.el
  (use-package company
    :defer 2
    :init
    (setq company-idle-delay nil)  ;; 禁用自动弹出补全
    :defines (company-dabbrev-ignore-case company-dabbrev-downcase)
    :hook (after-init . global-company-mode)
    :init (setq company-tooltip-align-annotations t
                company-minimum-prefix-length 3
                company-require-match nil
                company-dabbrev-ignore-case nil
                company-dabbrev-downcase nil
                company-show-numbers t)
    :config
    ;;(setq switch-window-input-style 'minibuffer)
    (setq company-minimum-prefix-length 3)
    (setq company-show-quick-access t)
    :bind
    (:map company-active-map
          ("C-n" . #'company-select-next)
          ("C-p" . #'company-select-previous)
          ("TAB" . company-complete-selection)
          ("M-h" . company-complete-selection)
          ("M-H" . company-complete-common)
          ("M-s" . company-search-candidates)
          ("M-S" . company-filter-candidates)
          ("M-n" . company-select-next)
          ("M-p" . company-select-previous))
    (:map leader-key
          ("y" . #'company-yasnippet))
    )
  (use-package company-box
    :ensure nil)
  (provide 'init-completion-company)
#+end_src
