etc/init-completion.el
(provide 'init-completion)

(when (display-graphic-p)
  (use-package vertico
    :bind (:map vertico-map
                ("RET"   . vertico-directory-enter)
                ("DEL"   . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word))
    :hook ((after-init . vertico-mode)
           (rfn-eshadow-update-overlay . vertico-directory-tidy))
    )
   (use-package vertico-posframe
      :ensure t
      :after (posframe vertico)
      :hook (vertico-mode . vertico-posframe-mode)
      :init (setq vertico-posframe-parameters '((left-fringe  . 8) (right-fringe . 8)))
      )
  )

(use-package corfu
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-auto-prefix 2)
  (corfu-auto-delay 1)
  (corfu-popupinfo-delay '(0.5 . 0.2))
  (corfu-preview-current 'insert)
  (corfu-preselect 'prompt)
  (corfu-on-exeact-match nil)
  :bind (:map corfu-map
              ("TAB" . corfu-next)
              ([tab] . corfu-next)
              ("C-n" . corfu-next)
              ("S-TAB" . corfu-previous)
              ([backtab] . corfu-previous)
              ("C-p" . corfu-previous)
              ("S-<return>" . corfu-insert)
              ("RET" . nil)
              ("<return>" . corfu-mode)
              ("C-y" . corfu-yank)
              ("C-g" . corfu-abort))
  :init
  (global-corfu-mode)
  (corfu-history-mode))

(use-package nerd-icons-corfu
  :after corfu
  :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
