etc/init-org.el
(use-package org-modern
  :custom
  ;;  (org-modern-table nil)
  (prettify-symbols-alist nil)
  :config
  ;; Disable Prettify Symbols mode globally or locally as needed
  ;;(global-prettify-symbols-mode -1)
  :hook ((org-mode . org-modern-mode)
         (org-agenda-finalize . org-modern-agenda)
         ))

(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  (setq org-roam-db-location "~/.emacs.d/var/org-roam.db")
  :custom
  ;; (org-roam-directory (file-truename "~/RoadNotes"))
  ;; The file-truename function is only necessary when you use
  ;; symbolic links inside org-roam-directory: Org-roam does not
  ;; resolve symbolic links.
  (make-directory (expand-file-name "daily" org-roam-directory) t)
  (org-roam-completion-everywhere t)
  (org-roam-dailies-capture-templates
   '(("d" "default" entry "* %<%I:%M %p>: %?"
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("n" . org-roam-dailies-capture-today)
         ("T" . org-roam-dailies-capture-tomorrow)
         ("v" . org-roam-dailies-capture-date)
         ("d" . org-roam-dailies-goto-today)
         ("t" . org-roam-dailies-goto-tomorrow)
         ("y" . org-roam-dailies-goto-yesterday)
         ("c" . org-roam-dailies-goto-date)
         ("b" . org-roam-dailies-goto-next-note)
         ("f" . org-roam-dailies-goto-previous-note)
         )
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode)

  )

;;; --- 笔记管理和组织
(define-prefix-command 'F9-map)
(global-set-key (kbd "<f9>") 'F9-map)
(lazy-load-set-keys
 '(("a" . org-agenda)
   ("A" . org-attach)
   ("s" . show-org-agenda)
   ("c" . org-capture)
   ("i" . org-toggle-inline-images)
   ("l" . org-toggle-link-display)
   ("d" . calendar)
   ("f" . suk/file-shortcuts/body)
   ("r" .  my-refile-map)
   )
nil
 "<f9>")
  (define-prefix-command 'my-refile-map)
  (global-set-key (kbd "C-c r") 'my-refile-map)
  ;; I use C-c c to start capture mode
  (global-set-key (kbd "C-c c") #'org-capture)
  ;; ;; (global-set-key (kbd "C-c C") 'org-capture)
  (global-set-key "\C-cl" #'org-store-link)
  (global-set-key "\C-ca" #'org-agenda)
  ;;(global-set-key "\C-cb" #'org-iswitchb)

  ;; C-',  C-, is org-cycle-agenda-files keys
  ;; 新版的org-mode使用C-c C-, 替换了 <sTAB 提供的模板功能。
