README.org
*** 手动触发
#+begin_src emacs-lisp :tangle  etc/init-completion.el
  ;;据说跟 lsp-bridge 冲突
  (setq company-idle-delay nil) 
  ;; (global-set-key (kbd "M-/") 'company-complete)  ;; 绑定 M-/ 为 company-complete
  ;; (global-set-key (kbd "M-?") 'dabbrev-expand)    ;; 绑定 M-? 为 dabbrev-expand
  (lazy-load-global-keys
   '(
     ("M-/" . company-complete)
     ("M-?" . dabbrev-expand)

     )
   "init-completion-company"
   )
#+end_src
** Use orderless
#+begin_src emacs-lisp :tangle etc/init-completion.el
  ;; Optionally use the `orderless' completion style.
  (require-package 'orderless)
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion))))
    (orderless-component-separator #'orderless-escapable-split-on-space))
  ;; Support Pinyin
  (use-package pinyinlib
    :after orderless
    :autoload pinyinlib-build-regexp-string
    :init
    (defun completion--regex-pinyin (str)
      (orderless-regexp (pinyinlib-build-regexp-string str)))
    (add-to-list 'orderless-matching-styles 'completion--regex-pinyin))
#+end_src
** Use consult
#+begin_src emacs-lisp :tangle etc/init-completion.el
  (use-package consult
    :bind (;; C-c bindings in `mode-specific-map'
           ("C-c M-x" . consult-mode-command)
           ([remap Info-search]        . consult-info)
           ([remap isearch-forward]    . consult-line)
           ([remap recentf-open-files] . consult-recent-file)

           ;; C-x bindings in `ctl-x-map'
           ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
           ("C-x b"   . consult-buffer)              ;; orig. switch-to-buffer
           ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
           ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
           ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
           ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
           ;; Custom M-# bindings for fast register access
           ("M-#"     . consult-register-load)
           ("M-'"     . consult-register-store)      ;; orig. abbrev-prefix-mark (unrelated)
           ("C-M-#"   . consult-register)
           ;; Other custom bindings
           ("M-y"     . consult-yank-pop)            ;; orig. yank-pop
           ;; M-g bindings in `goto-map'
           ("M-g e"   . consult-compile-error)
           ("M-g g"   . consult-goto-line)           ;; orig. goto-line
           ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
           ("M-g o"   . consult-outline)             ;; Alternative: consult-org-heading
           ("M-g m"   . consult-mark)
           ("M-g k"   . consult-global-mark)
           ("M-g i"   . consult-imenu)
           ("M-g I"   . consult-imenu-multi)
           ;; ("M-g M"   . consult-man)
           ;; ("M-g I"   . consult-info)
           ("M-g t"   . consult-theme)
           ("M-g h"   . consult-history)
           ;; M-s bindings in `search-map'
           ("M-s d"   . consult-find)
           ("M-s D"   . consult-locate)
           ("M-s g"   . consult-grep)
           ("M-s G"   . consult-git-grep)
           ("M-s r"   . consult-ripgrep)
           ("M-s l"   . consult-line)
           ("M-s L"   . consult-line-multi)
           ("M-s k"   . consult-keep-lines)
           ("M-s u"   . consult-focus-lines)
           ;; Isearch integration
           ("M-s e"   . consult-isearch-history)
           ("C-r" .  consult-line)
           :map isearch-mode-map
           ("M-e"     . consult-isearch-history)
           ("M-s e"   . consult-isearch-history)
           ("M-s l"   . consult-line)
           ("M-s L"   . consult-line-multi)
           ) 

    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)

    ;; The :init configuration is always executed (Not lazy)
    :init
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)
    :config
    (use-package consult-flyspell
      :bind ("M-g s" . consult-flyspell))

    (use-package consult-yasnippet
      :bind ("M-g y" . consult-yasnippet))
    ;; Use Consult to select xref locations with preview
    (with-eval-after-load 'xref
      (setq xref-show-xrefs-function #'consult-xref
            xref-show-definitions-function #'consult-xref))
    )


#+end_src
** nerd-icons-completion
#+begin_src emacs-lisp :tangle etc/init-completion.el
  
  (use-package nerd-icons-completion
    :when (icons-displayable-p)
    :hook (vertico-mode . nerd-icons-completion-mode))
#+end_src
** Misc
#+begin_src emacs-lisp :tangle  etc/init-completion.el
  (use-package emacs
    :init
    ;; TAB cycle if there are only few candidates
    (setq completion-cycle-threshold 3)

    ;; Only list the commands of the current modes
    (when (boundp 'read-extended-command-predicate)
      (setq read-extended-command-predicate
            #'command-completion-default-include-p))

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (setq tab-always-indent 'complete))

  ;; 在 Emacs 中，shackle 是一个专门用于控制弹出窗口（pop-up windows）和
  ;; 缓冲区显示方式的包。它可以帮助你为特定类型的 buffer 制定“在哪个窗口
  ;; 打开”、“打开时如何分割窗口”、“窗口大小”等规则，从而摆脱 Emacs 默认
  ;; 情况下可能随机或难以预测的弹出方式。与较早的 popwin 类似，但
  ;; shackle 提供了更灵活、细粒度的控制。
  (use-package shackle
    :init
    (shackle-mode 1)
    :config
    (setq shackle-rules
          '((compilation-mode :select t :align 'below :size 0.3)
            ("*Help*" :select t :align 'below :size 0.3)
            ("*Messages*" :select nil :align 'below :size 0.3)
            ("^\\*magit.*\\*$" :regexp t :align 'right :size 0.4 :select t))))

  (unless (display-graphic-p)
    ;; only conole packages
    )

#+end_src
* Tools
** setup
#+begin_src emacs-lisp :tangle etc/init-tools.el
  (provide 'init-tools)
#+end_src
Add to suk.el
#+begin_src emacs-lisp :tangle suk.el
  (require 'init-tools)
#+end_src
** Which Keys
:PROPERTIES:
:CUSTOM_ID: setup-which-keys
:END:
<<setup-which-keys>>
*** 安装
#+begin_src emacs-lisp :tangle install.el
    (require-package 'which-key)
#+end_src
*** 设置
#+begin_src emacs-lisp :tangle etc/init-tools.el
  ;; Display available keybindings in popup

  (use-package which-key
    :diminish
    :bind (("C-h M-m" . which-key-show-major-mode)
           (:map help-map ("C-h" . which-key-C-h-dispatch)))

    :hook (after-init . which-key-mode)
    ;;:custom
    ;; 弹出方式，底部弹出
    ;;(which-key-popup-type 'side-window)
    :init (setq which-key-max-description-length 30
                which-key-lighter nil
                which-key-show-remaining-keys t)
    :config
    (which-key-mode))

  (use-package which-key-posframe
    :after (which-key posframe)
    :config
    (which-key-posframe-mode 1))

#+end_src

** 英文助手
#+begin_src emacs-lisp :tangle etc/init-tools.el

  ;;; ### Company en words ###
  ;;; --- 英文助手
  (lazy-load-global-keys
   '(
     ("M-r" . toggle-company-english-helper) ;英文助手
     )
   "company-english-helper")
#+end_src
** Treemacs
A tree view component
#+begin_src emacs-lisp :tangle etc/init-tools.el
  (lazy-load-global-keys
   '(
     ("<f8>" . treemacs)
    )
  "init-treemacs")
#+end_src
** NeoTree
Another tree view component
#+begin_src emacs-lisp :tangle etc/init-tools.el
  ;; 设置打开 NeoTree 树形列表展示
  ;;(require-package 'neotree)
  ;;(use-package neotree
  ;;  :commands (projectile-switch-project neotree-dir)
  ;;  :config
  ;;  (setq neo-theme 'ascii           ; NeoTree 图标的样式
  ;;        neo-window-width 35
  ;;        neo-window-fixed-size nil) ; 设置 NeoTree 窗口的宽度可以使用鼠标调整
  ;;  :bind ("C-c o" . projectile-switch-project))


#+end_src

** Markdown support
#+begin_src emacs-lisp :tangle etc/init-tools.el
  (use-package markdown-mode)
#+end_src
** Regex tool
#+begin_src emacs-lisp :tangle etc/init-tools.el
  (use-package regex-tool)
#+end_src
** command log mode
#+begin_src emacs-lisp :tangle etc/init-tools.el
  ;; (use-package 'command-log-mode) ;; show the command you press the shortcuts. M-x command-log-mode, M-x clm/open-command-log-buffer

#+end_src
** server
#+begin_src emacs-lisp :tangle etc/init-tools.el
  ;;;; The emacsclient call depends on the daemon or `server-mode' (I use the latter)
  (use-package server
    :ensure nil
    :defer 1
    :config
    (unless (server-running-p)
      (server-start)))
#+end_src
** Misc
*** install
#+begin_src emacs-lisp :tangle install.el
  ;; efficiency
  (require-package 'helpful)
  (require-package 'wc-mode)
  (require-package 'ws-butler)
  (require-package 'async)
  (require-package 'popup) ; some old package need it
  (require-package 'htmlize) ; prefer stable version
  (require-package 'diminish)
  (require-package 'unfill)
  (require-package 'rainbow-delimiters)
#+end_src

