README.org
* 操作系统相关
#+begin_src emacs-lisp :tangle suk.el
  
  ;; Hanlde minified code
  (if emacs/>=27p (add-hook 'after-init-hook #'global-so-long-mode))
  (when sys/linuxp
    (load-if-exists (expand-file-name "linux.el" suk-emacs-root-dir)))
  (when sys/win32p
    (load-if-exists (expand-file-name "windows.el" suk-emacs-root-dir)))
  (when sys/macp
    (load-if-exists (expand-file-name "mac.el" suk-emacs-root-dir)))
#+end_src
** Linux
*** install
#+begin_src emacs-lisp :tangle install.el
  (require-package 'sudo-edit)
  (require-package 'pdf-tools) ;; use the package in extension
   
#+end_src
*** 设定
#+begin_src emacs-lisp :tangle linux.el
  ;; Your Linux specific settings

  ;; (setenv "JAVA_HOME" "/usr/lib/jvm/java-14-openjdk-amd64")

  ;; 开发工具
  (run-with-idle-timer
   1 nil
   #'(lambda()
       (require 'init-devtools)
       ))

  ;; Open files as another user
  (run-with-idle-timer
   2
   nil
   #'(lambda()
       (require 'my-sudo)
       ;; (use-package sudo-edit)
       (lazy-load-global-keys
        '(("C-z C-s" . suk/sudo/body))
        "my-sudo"
        )
       ))

  ;; On-the-fly spell checker
  (run-with-idle-timer
   2
   nil
   #'(lambda()
       (use-package flyspell
         :ensure t
         :defer 2
         :diminish flyspell-mode
         :if (executable-find "aspell")
         :hook (((text-mode outline-mode) . flyspell-mode)
                (prog-mode . flyspell-prog-mode)
                (flyspell-mode . (lambda ()
                                   (unbind-key "C-;" flyspell-mode-map)
                                   (unbind-key "C-," flyspell-mode-map)
                                   (unbind-key "C-." flyspell-mode-map))))
         :init
         (setq flyspell-issue-message-flag nil)
         (setq ispell-program-name "aspell")
         (setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_US" "--run-together")))))

  ;; 特有工具
  (run-with-idle-timer
   2
   nil
   #'(lambda()
       ;; run "M-x pdf-tools-install" at debian and open pdf in GUI Emacs
       (use-package pdf-tools
         :ensure t
         :config (pdf-tools-install))
       ))

  ;; 加载输入法
  (run-with-idle-timer
   1
   nil
   #'(lambda()
       (if suk-rime
           (require 'init-rime)
         ;;(require 'rain)
         (progn
           (require 'pyim-hyly)
           (pyim-hyly-enable))
         )
       ))

  ;; 其他
  (run-with-idle-timer
   1
   nil
   #'(lambda()
       (when (display-graphic-p)
         ;; only graphic packages
         )
       (unless (display-graphic-p)
         ;; only conole packages
         )
       ))
#+end_src

*** 终端
vterm是一个现代化、高性能且功能丰富的终端模拟器。它结合了高性能的
libvterm 后端和 Emacs 的强大功能，提供了接近原生终端的体验。

对于需要管理多个终端实例的用户，multi-vterm 是一个很好的扩展，能够方便
地在多个 vterm 实例之间切换，类似于 Terminator 的分屏和多标签功能。
#+begin_src emacs-lisp :tangle etc/init-vterm.el
  (provide 'init-vterm)
  ;; 配置 vterm
  (use-package vterm
    :ensure t
    :commands vterm
    :config
    (setq vterm-shell "/bin/bash"))  ;; 根据需要设置默认 shell


  ;; 定义 toggle-vterm 函数
  (defun toggle-vterm ()
    "Toggle a vterm window at the bottom of the current window.
  If the vterm window is already open, it will be hidden.
  Otherwise, a new vterm will be opened in a split below, with the current directory set to the buffer's directory."
    (interactive)
    (let* ((vterm-buffer-name "*vterm*")
           (existing-window (get-buffer-window vterm-buffer-name))
           (target-dir (if (and (buffer-file-name)
                                (file-directory-p (file-name-directory (buffer-file-name))))
                           (file-name-directory (buffer-file-name))
                         default-directory)))
      (if existing-window
          ;; 如果 vterm 窗口已经存在，则关闭它
          (delete-window existing-window)
        ;; 否则，创建一个新的 vterm 窗口
        (let ((default-directory target-dir))
          ;;(split-window-below)
          ;;(other-window 1)
          (vterm)
          ;;(vterm-other-window)
          ;; 切换到目标目录
          (vterm-send-string (concat "cd " (shell-quote-argument target-dir)))
          (vterm-send-return)
          ))
      ;; 保持原窗口焦点
      ;;(other-window 1)
      ))

  ;; 绑定快捷键
  (global-set-key (kbd "C-x C-t") 'toggle-vterm)
#+end_src
#+begin_src emacs-lisp :tangle linux.el
  (when (display-graphic-p)
    ;; only graphic packages
    (lazy-load-global-keys
     '(
       ("C-x C-t" . toggle-vterm))
     "init-vterm"
     )

    )
#+end_src
** Windows
#+begin_src emacs-lisp :tangle windows.el
  ;; Your windows specific settings

  ;; For example, (w32-register-hot-key [M-tab]) lets you use M-TAB normally in Emacs;
  
  ;; make PC keyboard's Win key or other to type Super or Hyper, for emacs running on Windows.
  (setq w32-pass-lwindow-to-system nil)
  (setq w32-lwindow-modifier 'super) ; Left Windows key

  (setq w32-pass-rwindow-to-system nil)
  (setq w32-rwindow-modifier 'super) ; Right Windows key

  (setq w32-pass-apps-to-system nil)
  (setq w32-apps-modifier 'hyper) ; Menu key


  ;; on windows, make pwsh the default shell
  ;; 2023-09-09
  (setq
   explicit-shell-file-name
   (cond
    ((eq system-type 'windows-nt)
     (let ((xlist
            (list
             "~/AppData/Local/Microsoft/WindowsApps/pwsh.exe"
             "C:/Windows/System32/WindowsPowerShell/v1.0/powershell.exe"
             )))
       (seq-some (lambda (x) (if (file-exists-p x) x nil)) xlist)))
    (t nil)))

  (run-with-idle-timer
   2
   nil
   #'(lambda()
       ;; Optimization
       (setq w32-get-true-file-attributes nil   ; decrease file IO workload
             w32-use-native-image-API t         ; use native w32 API
             w32-pipe-read-delay 0              ; faster IPC
             w32-pipe-buffer-size 65536)        ; read more at a time (64K, was 4K)
      ;;; Windows
       ;; spcial coding settings for Windows
       (unless (memq system-type '(cygwin windows-nt ms-dos))
         (setq selection-coding-system 'utf-8))
       )


   )


#+end_src
** MacOs
#+begin_src emacs-lisp :tangle mac.el
  ;; Your mac specific setting

  ;; set keys for Apple keyboard, for emacs in OS X
  (setq mac-command-modifier 'meta) ; make cmd key do Meta
  (setq mac-option-modifier 'super) ; make opt key do Super
  (setq mac-control-modifier 'control) ; make Control key do Control
  (setq ns-function-modifier 'hyper)  ; make Fn key do Hyper

  ;;(setenv "JAVA_HOME"  "path_to_java_folder/Contents/Home/")
  ;;(setq lsp-java-java-path "path_to_java_folder/Contents/Home/bin/java")

#+end_src
* 归档和例子
:PROPERTIES:
:CUSTOM_ID: achrives-and-examples
:END:
#+begin_src emacs-lisp :tangle achrives-and-examples.el
  ;; =========================================================
  ;; 通过编辑配置文件使其可以调用外部程序，来为其添加功能。
  ;; 增加命令
  ;;(defun lxr (names)
  ;;  (interactive "s查找联系人，请输入条件：")
  ;;  (call-process-shell-command "lxr" nil t t "-s" names))
  ;;执行命令
  ;;首先按功能键，Alt+x，然后输入命令 lxr 。
  ;;系统提示：“查找联系人，请输入条件："。
  ;;输入完成后，emacs 会执行命令lxr -s names，并输出执行的结果。
  ;; =========================================================
  ;; async-shell-command
#+end_src


