mac.el
;; Your mac specific setting

;; set keys for Apple keyboard, for emacs in OS X
(setq mac-command-modifier 'meta) ; make cmd key do Meta
(setq mac-option-modifier 'super) ; make opt key do Super
(setq mac-control-modifier 'control) ; make Control key do Control
(setq ns-function-modifier 'hyper)  ; make Fn key do Hyper

;;(setenv "JAVA_HOME"  "path_to_java_folder/Contents/Home/")
;;(setq lsp-java-java-path "path_to_java_folder/Contents/Home/bin/java")
